[{"name":"Spinz IO","description":"Play Spinz IO game online at Lagged.com. Spinz IO is one of our handpicked skill games that can be played on any device.","image":"/data_image/spinz-io-game-m7u.png","source_html":"https://lagged.com/api/play/fidget-spinner-battle2/","source_file":"https://lagged.com/en/g/spinz-io","category":["Skill Games","Multiplayer Games",".io Games","Fidget Spinner Games"],"content":"\n\nSpinz.io is a mesmerizing and fast-paced free online game! Set in a strange yet captivating world, your mission is to make your spinning top spin faster than any of your opponents. Collect colorful colors and powerups on the way to increase its speed and reach the top of the match. It's easy to begin playing, but difficult to master, so try your skills and challenge your friends today! Enjoy an amazing and unique experience full of frenetic action, bright colors and non-stop excitement--what are you waiting for? Spin to win!","howtoplay":"How to play: Mouse or finger to move","introduce":"Collect the food scattered around the screen in order to spin faster. The faster you are spinning the more dangerous you are! Compete against players from around the world in this online fidget spinner game. Keep playing until you get to the top of the global leaderboard."},{"name":"Mojo Mayhem","description":"Play Mojo Mayhem game online at Lagged.com. Mojo Mayhem is one of our handpicked action games that can be played on any device.","image":"/data_image/mojo-mayhem-game.jpg","source_html":"https://lagged.com/api/play/mojo-mayhem2/","source_file":"https://lagged.com/en/g/mojo-mayhem","category":["Action Games","Flying Games","Cartoon Games","Cartoon Network Games"],"content":"\n\nIn Mojo Mayhem, use your strategy and quick thinking to defeat your enemies. Take control of a powerful wizard and fight against countless monsters and bosses in an epic 3D adventure. Collect artifacts, improve your skills, and unleash powerful spells to win the battle. With stunning graphics and intense battles, Mojo Mayhem provides endless hours of entertainment. Unleash the ultimate magical force and prove your might!","howtoplay":"How to play: Click or tap to move the girls","introduce":"Help the Powerpuff Girls stop the evil villains throwing garbage all over the city. Save the day by stopping all of the mayhem that this evil genius is causing. Avoid the flying objects as you collect power ups in order to blast through each of the bosses at the end of each level."},{"name":"Extreme Sudoku","description":"Play Extreme Sudoku game online at Lagged.com. Extreme Sudoku is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/extreme-sudoku-game-wnz.png","source_html":"https://games.softgames.de/sudoku/?locale=en&p=pub-12406-12406","source_file":"https://lagged.com/en/g/extreme-sudoku","category":["Puzzle Games","Sudoku Games","Brain Games","Cool Math Games"],"content":"\n\nExtreme Sudoku is a unique and amazing puzzle game! Use your logical thinking skills to solve all the puzzles in the game and become the ultimate puzzle master. The aim is to complete the grid using the numbers 1-9, so that each row, column and mini-grid contain the correct answer. Think it sounds easy? Not quite - think twice before making your next move. Challenge yourself as you progress through increasingly difficult levels. Are you ready to take on the challenge? Play Extreme Sudoku and put your puzzle solving skills to the test!","howtoplay":"How to play: Click or tap to place numbers","introduce":"Sudoku with multiple difficulty levels to keep your brain challenged. A perfect game for all ability levels. Try to complete each of the puzzles by filling the board with numbers."},{"name":"Lego City Volcano","description":"Play Lego City Volcano game online at Lagged.com. Lego City Volcano is one of our handpicked skill games that can be played on any device.","image":"/data_image/lego-city-volcano-game-e56.jpg","source_html":"https://www.lego.com/en-us/gameshost/gamehtml/df023f19-4cb6-4604-91a2-5dbd54207e3f","source_file":"https://lagged.com/en/g/lego-city-volcano","category":["Skill Games","Cartoon Games"],"content":"\n\nExplore the stunning world of LEGO City Volcano! Go on adventurous expeditions, build with new volcano bricks, and even start a rescue mission. Take a boat ride, visit the lighthouse, and find hidden surprises along the way. Help workers clear the path for the Volcano Exploration Base, and search for rare crystals. Solve puzzles to unearth the hidden gems that are buried deep below the surface! Join the fun now and take your cannon to the next level!","howtoplay":"How to play: Click or tap to draw","introduce":"Quickly draw over each shape that appears on the screen. Help your team successfully drill deep into the volcano in this fun Lego City game from lego.com."},{"name":"Super Stacker 2","description":"Play Super Stacker 2 game online at Lagged.com. Super Stacker 2 is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/super-stacker-2-game.jpg","source_html":"https://html5.gamedistribution.com/3de0c1fd03414f92b4324ebfe54fc562/","source_file":"https://lagged.com/en/g/super-stacker-2","category":["Puzzle Games","Physics Games","Stacking Games"],"content":"\n\nSuper Stacker 2 is an exciting and challenging puzzle game that will test your reflexes and problem-solving skills. Use your limited number of blocks to carefully stack a tower that will safely support the added blocks. With increasing difficulty levels, each level provides a unique experience that will keep you on the edge of your seat until the peak stack is achieved. Put your stacking skills to the test and see how far you can go in Super Stacker 2!","howtoplay":"How to play: Click or tap to drop the blocks","introduce":"Drop the blocks on top of each other to stack them up high. Balance the funny faced blocks in order to pass each of the levels. A new HTML5 version of the classic flash game."},{"name":"Bouncing Balls","description":"Play Bouncing Balls game online at Lagged.com. Bouncing Balls is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/bouncing-balls-game-sf8.jpg","source_html":"https://html5.gamedistribution.com/7fbce90e7db74cf3817cbfac0e6684c2/","source_file":"https://lagged.com/en/g/bouncing-balls","category":["Puzzle Games","Bubble Games","Matching Games"],"content":"\n\nBouncing Balls is a fun and delightful game. Aim and shoot all the colorful balls on the board, making them bounce off and hit the same color. Chain reactions will happen when three or more balls of the same color collide. Get the highest score and challenge yourself on the leaderboard. Enjoy the game’s soothing music while aiming and shooting balls at colorful blocks. Try it and see how far you can get!","howtoplay":"How to play: Click or tap to shoot the balls","introduce":"Remove all of the balls from the field to pass each level. Quickly match 3 or more of the same colored balls to bounce them from play. Be quick so that the ceiling does not come crashing down on you."},{"name":"Banana Run","description":"Play Banana Run game online at Lagged.com. Banana Run is one of our handpicked skill games that can be played on any device.","image":"/data_image/banana-run-game-tgj.jpg","source_html":"https://play.famobi.com/banana-run/A-0D1OG","source_file":"https://lagged.com/en/g/banana-run","category":["Skill Games","Running Games","Animal Games"],"content":"\n\nBanana Run is an exciting and fast-paced game that will have you hooked in no time! Dodge obstacles, collect coins and bananas, and avoid the hungry monkey to keep your score high. Travel far and wide, unlocking new levels and worlds as you go. Show off your reflexes and agility as you traverse challenging and fun levels of non-stop action. Play alone or compete with friends to prove who's the best! Have fun and try to beat your high-score today!","howtoplay":"How to play: Click or tap to jump","introduce":"Collect some tasty bananas as you run and jump from platform to platform. Avoid any obstacles and do not fall in between any gaps, or it is game over. Help this cute and funny monkey collect as many bananas as possible in order to get a high score."},{"name":"Pinball One","description":"Play Pinball One game online at Lagged.com. Pinball One is one of our handpicked skill games that can be played on any device.","image":"/data_image/pinball-one-game.png","source_html":"https://lagged.com/api/play/pinball-one3/","source_file":"https://lagged.com/en/g/pinball-one","category":["Achievement Games","Skill Games","Pinball Games","Arcade Games"],"content":"\n\nPinball One is a thrilling arcade game where you play as a pinball master through exciting 3D levels. Navigate each level with skillful flippers and master challenging obstacles as you collect points and clear levels. Avoid traps and obstacles while scoring points to try and get the highest score! With stunning design, amazing graphics and realistic physics, Pinball One is guaranteed to provide excitement and an immersive experience. Play Pinball One and become a true pinball master!","howtoplay":"How to play: Arrow keys or tap to move paddles","introduce":"You have one ball to score as many points as possible in this fun pinball game. Hit the ball back and forth using your paddles to save it from the spikes below. Collect gems and jewels as the colors shift on you periodically for an added twist."},{"name":"Ice Jump","description":"Play Ice Jump game online at Lagged.com. Ice Jump is one of our handpicked strategy games that can be played on any device.","image":"/data_image/ice-jump-game.png","source_html":"https://lagged.com/api/play/ice-jump/","source_file":"https://lagged.com/en/g/ice-jump","category":["Achievement Games","Strategy Games","Jumping Games","Platform Games","Bloody Games"],"content":"\n\nJump your way to the top! Ice Jump is an exciting and fast-paced game that will keep you on your toes. Your goal is to jump from block to block of descending ice and try to go as high as you can before you lose your balance and fall down. See if you can beat your top score and challenge your friends with your achievements. With fantastic visuals and easy to learn gameplay, Ice Jump is the perfect game to enjoy with your friends online!","howtoplay":"How to play: Click or tap to jump","introduce":"Avoid all of the different obstacles as you jump through each level. Try to beat all 18 levels in as few attempts as possible. Avoid blocks, spikes, saws and more as you help your character escape from each of the wintery and dangerous levels."},{"name":"Toastellia","description":"Play Toastellia game online at Lagged.com. Toastellia is one of our handpicked girl games that can be played on any device.","image":"/data_image/toastellia-game-2ul.jpg","source_html":"https://html5.gamedistribution.com/19672eaf8119448687a36e95479a2f51/","source_file":"https://lagged.com/en/g/toastellia","category":["Girl Games","Cooking Games","Food Games"],"content":"\n\nWelcome toToastellia, the fast-paced cooking game! Join the young baker, Toastella and her loyal pet toaster, as they conquer the culinary world! Players must be quick and observant to complete levels properly. Get ready to bake, serve, and collect coins as you play your way through the unique game's fun levels. Support Toastella in her quest to become the best baker and test your cooking and time management skills! Have fun creating delicious meals while mastering culinary challenges!","howtoplay":"How to play: Click or tap to cook toast","introduce":"Bake up some tasty sandwiches to feed your very hungry customers. Get each of the orders correctly in order to get a big tip and make enough money to pass each level. Toast the bread, top with meat and veggies, then finish off with condiments."},{"name":"Neon Pong","description":"Play Neon Pong game online at Lagged.com. Neon Pong is one of our handpicked skill games that can be played on any device.","image":"/data_image/neon-pong-game2.jpg","source_html":"https://lagged.com/api/play/neon-pong/","source_file":"https://lagged.com/en/g/neon-pong","category":["Achievement Games","Skill Games","Two Player Games","Arcade Games","Ball Games","Timing Games"],"content":"\n\nNeon Pong is a fun and fast-paced online game. It's a modern take on the classic game of Pong, and a great way to pass the time with friends. With vibrant neon graphics and smooth physics, the gameplay is highly engaging and exciting. In addition, you can customize the game with different ball speed options, making it more fun and challenging. Get ready to battle it out in neon-filled arenas, and show off your reflexes and skills! Play Neon Pong now and let the fun begin!","howtoplay":"How to play: A,D, Arrow keys or Mouse/Finger to move your paddle.","introduce":"The classic game of Pong now with a cool neon theme. Two different modes to try out, Classic and Boosted. Hit the ball back and forth trying to out smart and out play your opponent. Go grab a friend to compete in two player mode!"},{"name":"Jungle Run","description":"Play Jungle Run game online at Lagged.com. Jungle Run is one of our handpicked skill games that can be played on any device.","image":"/data_image/jungle-run-game-k6x.jpg","source_html":"https://play.famobi.com/jungle-run/A-0D1OG","source_file":"https://lagged.com/en/g/jungle-run","category":["Skill Games","Animal Games","Jumping Games"],"content":"\n\nJungle Run is a fun and fast-paced platformer game. Guide the bearded explorer through a mysterious temple in the middle of the jungle and dodge dangerous obstacles. Jump over giant spiders, swing on ropes and hop across platforms as you make your way to the temple's entrance. Time your jumps carefully and don't fall into the lava below as you try to reach the top and find the ancient treasure. Play Jungle Run and enjoy a thrilling quest of exploration and adventure!","howtoplay":"How to play: Arrow keys or tap controls to jump","introduce":"Help Kiba and Kumba jump and roll over different obstacles in this super fun running game. Choose your ape at the start then help the girl or boy monkey run as far as possible. Collect stars for extra points in this awesome running game."},{"name":"Gogi Adventure","description":"Play Gogi Adventure game online at Lagged.com. Gogi Adventure is one of our handpicked skill games that can be played on any device.","image":"/data_image/gogi-adventure-game.png","source_html":"https://lagged.com/api/play/gogi-adventure/","source_file":"https://lagged.com/en/g/gogi-adventure","category":["Achievement Games","Skill Games","Jumping Games","Platform Games","Arcade Games"],"content":"\n\nGogi Adventure is a fun, interactive platformer game where you help Gogi explore his world. Navigate through colorful levels, collect coins and power-ups, and battle enemies in this exciting and challenging journey. Unlock special abilities to progress and reach each level's objective. With plenty of levels to explore and hidden areas to discover, Gogi Adventure offers hours of exciting fun. Experience new environments and explore puzzles, enemies, and secret rewards as you progress further through your journey. Come join Gogi in this exciting adventure today!","howtoplay":"How to play: Click or tap to jump","introduce":"Walk around the planet for as long as possible, without running into any of the monsters and creatures. Simply jump out of the way as you orbit around the small planet collecting coins. Keep playing until you get your name at the top of the leaderboards."},{"name":"Monsters Up","description":"Play Monsters Up game online at Lagged.com. Monsters Up is one of our handpicked skill games that can be played on any device.","image":"/data_image/monsters-up-game.png","source_html":"https://lagged.com/api/play/monsters-up/","source_file":"https://lagged.com/en/g/monsters-up","category":["Achievement Games","Skill Games","Tower Games","Monster Games","Stacking Games"],"content":"\n\nMonsters Up is a colorful, fun-filled game that will keep you entertained for hours. In this game, you must help the cute monsters reach the top of the towers by switching platforms, avoiding bombs, and collecting coins. With exciting gameplay, colorful characters, and an upbeat soundtrack, Monsters Up is an enjoyable way for players of all ages to pass the time. Challenge your friends and see who can survive the longest journey of Monsters Up!","howtoplay":"How to play: Click or tap to jump","introduce":"Time your jumps just right so you land safely on top of the next building platform. Try to stack and balance the platforms perfectly as you build high into the sky. If you run into a platform or if your tower tumbles, it is game over!"},{"name":"Cricket Fielder Challenge","description":"Play Cricket Fielder Challenge game online at Lagged.com. Cricket Fielder Challenge is one of our handpicked sports games that can be played on any device.","image":"/data_image/cricket-fielder-challenge-game.png","source_html":"https://lagged.com/api/play/cricket-fielder-challenge/","source_file":"https://lagged.com/en/g/cricket-fielder-challenge","category":["Achievement Games","Sports Games","Cricket Games","Ball Games"],"content":"\n\nDo you have what it takes to be an amazing cricket fielder? Test your skills in Cricket Fielder Challenge! You'll need fast reactions and keen vision to catch each ball, one mistake could cost you the match. With five unique levels to choose from, including night mode, you can put your fielding capabilities to the test. Do you have what it takes? Experience the fun and unique challenge of Cricket Fielder Challenge now!","howtoplay":"How to play: Move hands with mouse or finger","introduce":"Try to catch the ball in one of your hands without it flying past you. This game will take a bit to get used to, but try to have the ball land perfectly in the palm of your hand. Very fun sports game for anyone, even if you do not know about Cricket."},{"name":"Steam Camp","description":"Play Steam Camp game online at Lagged.com. Steam Camp is one of our handpicked action games that can be played on any device.","image":"/data_image/steam-camp-game.png","source_html":"https://lagged.com/games/play2/steam-camp-new1/","source_file":"https://lagged.com/en/g/steam-camp","category":["Achievement Games","Action Games","Cartoon Network Games","Cartoon Games","Camping Games","Flying Games","Kid Games"],"content":"\n\nSteam Camp is the perfect game for anyone who loves crafting and creativity! Create, build and explore in an immersive virtual campground. Gather items and build your own unique structures with the help of a friendly robot. Collect coins and unlock new items. Discover hidden secrets and go on wild adventures. With a colorful, vibrant map to explore and exciting tasks to complete, Steam Camp will keep you entertained and happy for hours. Start your camping adventure today!","howtoplay":"How to play: Arrow keys or tap controls to fly and shoot. Spacebar to shoot. X key to rotate.","introduce":"Ben 10 is here to save the day! Rescue all of the campers and bring them back to your base as you fire away at bots and other machinery. Collect power ups to improve your health or shield you from attacks to aid in your mission of saving all of your friends in this epic online Ben 10 game."},{"name":"Lizard Rocket","description":"Play Lizard Rocket game online at Lagged.com. Lizard Rocket is one of our handpicked skill games that can be played on any device.","image":"/data_image/lizard-rocket-game.png","source_html":"https://lagged.com/api/play/lizard-rocket/","source_file":"https://lagged.com/en/g/lizard-rocket","category":["Skill Games","Arcade Games","Flying Games","Distance Games","Animal Games"],"content":"\n\nLizard Rocket is an exciting and fast-paced action game for players of all ages. Launch your rocket into the air and avoid obstacles as you climb as high as you can! Collect coins and power-ups for an extra edge, and challenge yourself to reach new heights. Test your reaction time and demonstrate your agility as you try to make it to the top. Have fun and reach for the stars in Lizard Rocket!","howtoplay":"How to play: Click or tap to fly","introduce":"Your lizard is strapped in and ready to fly to the moon! Help your friendly pet fly as high as possible. Collect coins as you avoid fallings rocks in this super fun distance game. How high can you fly before crashing?"},{"name":"Fidget Spinner Designer","description":"Play Fidget Spinner Designer game online at Lagged.com. Fidget Spinner Designer is one of our handpicked girl games that can be played on any device.","image":"/data_image/fidget-spinner-designer-game-wzp.jpg","source_html":"https://play.famobi.com/fidget-spinner-designer/A-0D1OG","source_file":"https://lagged.com/en/g/fidget-spinner-designer","category":["Girl Games","Dress Up Games","Fidget Spinner Games"],"content":"\n\nFidget Spinner Designer is a fun game that will engage your creativity and skill. Pick from hundreds of designs and color combinations to create the coolest and wildest model of your own! By answering fun quizzes you'll get coins that you can use to buy new materials and textures. With these new features, you can design the best looking spinner ever, and have tons of fun doing it. Pick a color, design, upgrade and spin the day away! Try this exciting game for yourself and have hours of creative, fast-paced fun!","howtoplay":"How to play: Click or tap to spin","introduce":"Design your very own fidget spinner! Choose the style then add parts. Finally add colors, stickers and other cool accessories to your fidget spinner."},{"name":"Best Classic Mahjong Connect","description":"Play Best Classic Mahjong Connect game online at Lagged.com. Best Classic Mahjong Connect is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/best-classic-mahjong-connect-game-j5j.png","source_html":"https://games.softgames.de/best-classic-mahjong-connect/?locale=en&p=pub-12406-12406","source_file":"https://lagged.com/en/g/best-classic-mahjong-connect","category":["Puzzle Games","Mahjong Games","Brain Games","Soft Games"],"content":"\n\nExperience a timeless classic and enjoy the captivating tile-matching puzzle game Best Classic Mahjong Connect! Take on the challenge of joining matching pairs of tiles, mastering the tricky layouts and gathering all the pairs. Use your memory and reasoning skills to find the appropriate pairs before running out of time. With its unique colorful illustrations and intuitive gameplay, you will have endless hours of engaging entertainment. Forget all your worries and have a blast with Best Classic Mahjong Connect!","howtoplay":"How to play: Click or tap to select matches","introduce":"Try to match the Chinese themed Mahjong tiles together. Remove all of the tiles from the board to pass each of the levels. One of the best classic themed Mahjong games we have every played."},{"name":"Soccer Heads","description":"Play Soccer Heads game online at Lagged.com. Soccer Heads is one of our handpicked sports games that can be played on any device.","image":"/data_image/soccer-heads-game-vft.jpg","source_html":"https://play.famobi.com/soccer-heads/A-0D1OG","source_file":"https://lagged.com/en/g/soccer-heads","category":["Sports Games","Soccer Games","Goal Games","Two Player Games","World Cup Games"],"content":"\n\nSoccer Heads is an addicting and frenetic game of soccer fun. Choose your favourite player and join the game. See if you have the skills to make it to the top of the leaderboard. Use your reflexes and wits as you flick and kick your way to the goal. Enjoy intense matches with your friends and family, collecting power-ups to become the ultimate soccer star! Outshout and outsmart your opponents in this fast-paced and entertaining game. Soccer Heads is the perfect way to have some fun, show off your soccer skills and have a blast!","howtoplay":"How to play: Arrow keys or tap controls to move and kick","introduce":"Choose your favorite funny soccer player head then go join the fun! Compete against the computer in tournament mode or against a friend in two player mode. Keep kicking away and defending your goal as you try to score enough points to beat your opponent in each round."},{"name":"BrickZ","description":"Play BrickZ game online at Lagged.com. BrickZ is one of our handpicked strategy games that can be played on any device.","image":"/data_image/brickz-game-0ap.png","source_html":"https://html5.gamedistribution.com/2c3a4762932e474ebf78124c4de3fbf0/","source_file":"https://lagged.com/en/g/brickz","category":["Strategy Games","Snake Games","Arcade Games"],"content":"\n\nBrickz is a classic puzzler with a modern twist! Take on simple, fun challenges to move up the leaderboard or challenge your friends online. The aim of the game is simple - line up three or more bricks of the same color to make them disappear and score points. Think fast, clear levels and compete with players around the world to become the top brick smasher. Get ready to enjoy hours of fun with Brickz!","howtoplay":"How to play: Swipe to move your snake","introduce":"The snake is challenging the blocks in this super addicting arcade game. Collect stars and food to grow your snake as you run through the blocks. Keep playing until you reach the end goal."},{"name":"Fat Boy Dream","description":"Play Fat Boy Dream game online at Lagged.com. Fat Boy Dream is one of our handpicked skill games that can be played on any device.","image":"/data_image/fat-boy-dream-game.png","source_html":"https://lagged.com/api/play/fat-boy-dream4/","source_file":"https://lagged.com/en/g/fat-boy-dream","category":["Achievement Games","Skill Games","Food Games","Arcade Games","Jumping Games"],"content":"\n\nFat Boy Dream is an adventure-filled game that will have you running and jumping through dangerous levels! Follow the twists and turns as you battle through obstacles in order to escape the clutches of your evil enemies. Collect coins to unlock upgrades and power-ups as you progress. Enjoy stunning graphics, exhilarating music and unlimited fun! Guide the fat boy through unique levels to rescue his dream and bring peace to the world. Conquer dangerous boss fights and enjoy the ride of a lifetime!","howtoplay":"How to play: Click or tap to jump","introduce":"help the hungry boy jump from donut to donut in search for tasty treats. Avoid falling off of the edge as you try to climb higher and higher in this very good dream of yours. Do you dream of flying in the sky and eating sweets all day?"},{"name":"Extreme Racer","description":"Play Extreme Racer game online at Lagged.com. Extreme Racer is one of our handpicked racing games that can be played on any device.","image":"/data_image/extreme-racer-game.png","source_html":"https://lagged.com/api/play/extreme-racer/","source_file":"https://lagged.com/en/g/extreme-racer","category":["Achievement Games","Racing Games","Car Games","Driving Games"],"content":"\n\nExtreme Racer is an adrenaline filled driving game! Race against other cars to the finish line, or simply explore a vast and detailed open world. Take control of a range of vehicles, from classic muscle cars to powerful futuristic models. Enjoy stunning visuals, realistic atmospheres and exciting race tracks. Whether you're looking for a casual driving experience or an intense race, Extreme Racer is sure to give you the ride of your life! Buckle up, hit the gas and join the race!","howtoplay":"How to play: Arrow keys or tap controls to drive","introduce":"Quickly shift lanes as you avoid the other cars on the road as well as road blocking obstacles. Collect the speed boost in order to slam into cars to clear them off of the road. Try to drive for as long as possible without causing any accidents."},{"name":"Fidget Spinner Mania","description":"Play Fidget Spinner Mania game online at Lagged.com. Fidget Spinner Mania is one of our handpicked skill games that can be played on any device.","image":"/data_image/fidget-spinner-mania-game.png","source_html":"https://lagged.com/api/play2/fidget-spinner-mania2/","source_file":"https://lagged.com/en/g/fidget-spinner-mania","category":["Achievement Games","Skill Games","Fidget Spinner Games","Arcade Games","Timing Games","Upgrade Games"],"content":"\n\nFidget Spinner Mania is the ultimate test of skill and reflexes! Spin your way to the top of the leaderboards with lightning-fast spins. Show off your skills with detailed spins and a wide array of bonus objectives. Pass the time with fast-paced gameplay, high-quality graphics, and challenging objectives. Play now and witness the thrills and excitement of a classic arcade game with a modern twist!","howtoplay":"How to play: Swipe with finger or mouse to spin the fidget spinner.","introduce":"Are you ready for some more Fidget Spinner fun? Unlock over 10 different designs as you spin your toy like crazy. Upgrade the speed and friction to increase the amount of spins and the amount of money you earn. Keep playing until you unlock all 5 achievements."},{"name":"Doctor Acorn 2","description":"Play Doctor Acorn 2 game online at Lagged.com. Doctor Acorn 2 is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/doctor-acorn-2-game-hbv.jpg","source_html":"https://play.famobi.com/doctor-acorn-2/A-0D1OG","source_file":"https://lagged.com/en/g/doctor-acorn-2","category":["Puzzle Games","Thinking Games","Brain Games"],"content":"\n\nDoctor Acorn 2 is an exciting and challenging puzzle game! Travel alongside Doctor Acorn as he navigates his way through a treacherous forest full of obstacles. Your job is to help him collect all the vital missing pieces of his broken space ship so he can make it back to his laboratory. Guide Doctor Acorn through levels full of tricky puzzles, clever collectables, and dangerous enemies. Enjoy this fun and entertaining game and try to complete each level in the fastest time possible!","howtoplay":"How to play: Click or tap to interact","introduce":"Help the doctor roll around the screen using different objects. Activate fans and other items to help the acorn move down each level. Try to collect all of the stars as you attempt to complete all 10 levels."},{"name":"One More Flight","description":"Play One More Flight game online at Lagged.com. One More Flight is one of our handpicked skill games that can be played on any device.","image":"/data_image/one-more-flight-game-uqw.jpg","source_html":"https://html5.gamedistribution.com/e3df95b8f95747b4ae0d2e109e8411de/","source_file":"https://lagged.com/en/g/one-more-flight","category":["Skill Games","Airplane Games"],"content":"\n\nOne More Flight is an enjoyable, relaxing game. Take control of a paper plane and fly it through the sky. Enjoy beautiful smooth graphics and relaxing music as you soar above the clouds. When you reach the end of your flight you can compare the distance with friends and see who can make it the farthest. Keep testing and honing your skills to become the ultimate paper plane pilot!","howtoplay":"How to play: Click or tap to fly","introduce":"Fly your airplane from airport to airport without crashing. Collect stars along the way in this fun flight simulator game."},{"name":"Two Sides","description":"Play Two Sides game online at Lagged.com. Two Sides is one of our handpicked skill games that can be played on any device.","image":"/data_image/two-sides-game.jpg","source_html":"https://lagged.com/api/play/two-sides3/","source_file":"https://lagged.com/en/g/two-sides","category":["Achievement Games","Skill Games","Brain Games","Arcade Games","Timing Games"],"content":"\n\nTwo Sides is a fun and addictive game that challenges you to do quick reflex tests in order to survive. In this game you will find yourself in a very dangerous situation - standing between two sides and you have to quickly switch from one side to the other. React quickly and with precision to switch between each side and make your way to the finish line. The longer you survive, the higher your score will be! Give it a try and test your reflexes with Two Sides!","howtoplay":"How to play: Click or tap on the correct side","introduce":"Tap the right or left side depending on the instructions in the square. As you score increases your time limit decreases. Quickly choose left or right and try to not make any mistakes or it is game over."},{"name":"Trigon FRVR","description":"Play Trigon FRVR game online at Lagged.com. Trigon FRVR is one of our handpicked skill games that can be played on any device.","image":"/data_image/trigon-frvr-game-t49.png","source_html":"https://trigon.frvr.com/","source_file":"https://lagged.com/en/g/trigon-frvr","category":["Skill Games","Arcade Games","Color Games"],"content":"\n\nTrigon FRVR is an addicting and exciting puzzle game where you have to use your wits and fast reflexes in order to solve every level. You have to fill the board with shapes by rotating the triangles in the right direction. Blocks of the same color must touch each other in order to clear the board. With easy-to-learn controls, this game will bring you hours of entertainment and intense puzzling. Challenge yourself and improve your skills, but beware - you won't be able to stop playing!","howtoplay":"How to play: Click or tap to rotate","introduce":"Rotate the triangle so that the top color matches the colored lines coming towards you. Keep matching the colors as the game speeds up and gets a lot harder."},{"name":"Bus Rally","description":"Play Bus Rally game online at Lagged.com. Bus Rally is one of our handpicked racing games that can be played on any device.","image":"/data_image/bus-rally-games.jpg","source_html":"https://lagged.com/api/play/bus-rally-tps/","source_file":"https://lagged.com/en/g/bus-rally","category":["Achievement Games","Racing Games","Driving Games","Truck Games"],"content":"\n\nBus Rally is a fun and challenging racing game! As a bus driver, race your team of buses around the track and be the first to reach the finish line. You must be careful around the tight turns and avoid crashing into other buses. Collect coins to upgrade and customize your bus. Test your driving skills and see how quickly you can reach the end of the track in this exciting bus racing game. So hop on board and get revving – the race has already begun!","howtoplay":"How to play: Tap controls or arrow keys to drive","introduce":"Jump into the drivers seat of your bus and race up and down the hills towards the checkered flag. Try to earn three stars in each level so you can unlock new vehicles and new levels. Keep an eye on your gas levels so you do not run out of gas before finish the level."},{"name":"Space Trip","description":"Play Space Trip game online at Lagged.com. Space Trip is one of our handpicked strategy games that can be played on any device.","image":"/data_image/space-trip-game.jpg","source_html":"https://lagged.com/api/play/space-trip/","source_file":"https://lagged.com/en/g/space-trip","category":["Achievement Games","Strategy Games","Space Games","Flying Games","Distance Games","Alien Games"],"content":"\n\nSpace Trip is an exciting and fun arcade game! Enjoy the thrilling experience of traveling across the universe as you dodge obstacles and collect power-ups in this hyperactive and thrilling adventure. Explore the vastness of space at your own pace and have a blast while doing so. There are colorful planets, moving obstacles, and a variety of power-ups to help you evade danger and get the highest score possible. Try your skill, speed and luck and enjoy the chaotic but exhilarating action of this immersive and addicting game!","howtoplay":"How to play: Click or tap and hold to fly your astronaut","introduce":"Help the astronaut fly through outer-space! Avoid asteroids, planets and even satellites as you try to collect as many coins as possible. Keep dodging the obstacles as long as possible in order to get your name at the top of the leaderboards in this fun space flying game."},{"name":"Plumber","description":"Play Plumber game online at Lagged.com. Plumber is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/plumber-game.jpg","source_html":"https://lagged.com/api/play2/plumber3/","source_file":"https://lagged.com/en/g/plumber","category":["Achievement Games","Puzzle Games","Brain Games","Thinking Games"],"content":"\n\nPlumber is an addictive and addicting puzzle game! In each level, you must rotate and connect the pipes in order to guide a flow of liquid from start to finish. With each level you complete, the more challenging and complex the pipes become. Plumber is perfect for those who enjoy puzzle games, logic challenges and a bit of strategy. Play through over 150 levels and enjoy the satisfaction of being crowned a master plumber!","howtoplay":"How to play: Click or tap to rotate the pipes","introduce":"Help the plumber fix all of the pipes before the time expires. Quickly rotate the pipes so that the water will flow freely from left to right before the sewage rises to the top. Try to beat all 30 levels and earn all 90 stars in this fast paced puzzle game. As you progress the levels get increasingly more difficult."},{"name":"Cup and Ball","description":"Play Cup and Ball game online at Lagged.com. Cup and Ball is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/cup-and-ball-game.jpg","source_html":"https://lagged.com/api/play/cup-and-ball2/","source_file":"https://lagged.com/en/g/cup-and-ball","category":["Achievement Games","Puzzle Games","Physics Games","Thinking Games","Brain Games"],"content":"\n\nCup and Ball is a classic skill game that's easy to pick up, yet can take a lifetime to master. Throw the ball so it lands inside the cup and the game gradually picks up speed and difficulty. The ultimate challenge is to keep your eye on the prize and react quickly! Race against your friends or challenge yourself to achieve a high score. Test your coordination and reflexes with Cup and Ball!","howtoplay":"How to play: Click or tap and drag to move objects","introduce":"Place different shapes onto the screen to help the ball safely into the cup. On the left are your available shapes that you can use, place those on the screen then tap on the tunnel to release the ball. If the ball falls off of the screen start over again, readjusting your shape positions so the ball can land safely in the cup."},{"name":"Winter Adventures","description":"Play Winter Adventures game online at Lagged.com. Winter Adventures is one of our handpicked skill games that can be played on any device.","image":"/data_image/winter-adventures-game-jsj.jpg","source_html":"https://play.famobi.com/winter-adventures/A-0D1OG","source_file":"https://lagged.com/en/g/winter-adventures","category":["Skill Games","Arcade Games","Adventure Games"],"content":"\n\nRun, jump and slide through winter landscapes with Winter Adventures! This fun and addictive game will take you through multiple levels of challenging obstacles and objectives. Use your skills and reflexes to help the hero collect coins, keys and other items from the forest. Power boosts and secret shortcuts upgrade your experience, so you can jump further and faster across the snowy terrain. Keep an eye on the clock and try to reach the finish line with the highest score possible. Enjoy Winter Adventures today!","howtoplay":"How to play: Click or tap to interact","introduce":"Complete different adventurous mini games as you explore the winter wonderland! Help your funny looking character skate on the ice, throw snow balls and more."},{"name":"My Dolphin Show","description":"Play My Dolphin Show game online at Lagged.com. My Dolphin Show is one of our handpicked girl games that can be played on any device.","image":"/data_image/my-dolphin-show-game-p53.png","source_html":"https://html5.gamedistribution.com/5ad7018b60994251a15217416e9ed0fe/","source_file":"https://lagged.com/en/g/my-dolphin-show","category":["Girl Games","Animal Games"],"content":"\n\nMy Dolphin Show is a fun and engaging game for all ages. In this game, you control a cute dolphin and have its show off its amazing tricks. You can choose to show off crazy stunts, or even just swim and have fun. Use boosts and combos to get extra points and rack up the high score! With different levels, vibrant graphics, and no time limits, you can practice until you become the master of the oceans! Play My Dolphin Show today and get ready to have loads of fun!","howtoplay":"How to play: Click or tap to interact","introduce":"Train your dolphin to do tricks so that you can WOW the crowd. Unlock new areas, new sea creatures and new stunts to further your career as a trainer."},{"name":"Punch","description":"Play Punch game online at Lagged.com. Punch is one of our handpicked action games that can be played on any device.","image":"/data_image/punching-game.jpg","source_html":"https://lagged.com/api/play/punch3/","source_file":"https://lagged.com/en/g/punch","category":["Achievement Games","Action Games","Boxing Games","Fighting Games"],"content":"\n\nPunch is a fun and addicting fighting game where you must battle your way to victory. Choose your unique fighter and get ready to battle enemies in the ring. Utilize your special moves, such as uppercuts and jabs, to take down opponents and come out on top! Featuring an array of characters and power-ups, Punch will provide an exhilarating gaming experience. So rack up those wins and prove that you have what it takes to be the ultimate fighter!","howtoplay":"How to play: Arrow keys or tap to punch","introduce":"Punch left and right as you play in one of the two modes. Master Punch mode where you need to punch the boxing gloves before they hit you, or master Fight mode where you need to hit your opponent 100 times before he hits you. This is the ultimate skill based boxing game online!"},{"name":"Bob the Robber","description":"Play Bob the Robber game online at Lagged.com. Bob the Robber is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/bob-the-robber-game.jpg","source_html":"https://html5.gamedistribution.com/18d28481ea514f3c838f9a5a355fb0f7/","source_file":"https://lagged.com/en/g/bob-the-robber","category":["Puzzle Games","Platform Games","Adventure Games","Police Games","Kid Games"],"content":"\n\nBob the Robber is an exciting game of cat and mouse! Take control of Bob and help him outsmart the guards in each level as you sneak around houses to snatch the loot. Use your wit to disable security systems and discover hidden loot, all while avoiding detection. Make a clean getaway with your loot and keep the police off your trail with strategically placed decoys and distractions. Be a master thief and outsmart the security guards in Bob the Robber!","howtoplay":"How to play: Tap controls or use arrow keys to move, spacebar for action.","introduce":"Help Bob steal different items from the buildings without being detected by the security cameras or the watch dog robots. If you are successful you will become the most famous thief of all time. Pick locks, evade capture and collect the most precious prizes of all."},{"name":"Fidget Spinner Battle","description":"Play Fidget Spinner Battle game online at Lagged.com. Fidget Spinner Battle is one of our handpicked strategy games that can be played on any device.","image":"/data_image/fidget-spinner-battle-game.jpg","source_html":"https://lagged.com/api/play/fidget-spinner-battle2/","source_file":"https://lagged.com/en/g/fidget-spinner-battle","category":["Strategy Games","Two Player Games","Fidget Spinner Games","War Games"],"content":"\n\nTest your skills with Fidget Spinner Battle! Players take turns spinning the fidget spinner as fast as they can and the one who stops first loses! With realistic visuals, cool sound effects and 4 different spinners, you will be entertained for hours. Spice up your game play with a daily challenge that tests your skill. Pick your fidget spinner and get ready for battle! Battle your way up the leaderboards and prove that you are the ultimate spinner champion. Enjoy the battle and try to become the best!","howtoplay":"How to play: Click or tap to spin","introduce":"Battle against the computer or a friend to see who can spin their fidget spinner faster! Improve your spinning skills against the AI then grab your phone or tablet to challenge a friend in 2 player mode. Keep the toy rotating so you can get the max rotations within the time limit to win each battle."},{"name":"Snake vs Block Online","description":"Play Snake vs Block Online game online at Lagged.com. Snake vs Block Online is one of our handpicked skill games that can be played on any device.","image":"/data_image/snake-vs-block-game.jpg","source_html":"https://lagged.com/api/play2/snake-vs-blocks/","source_file":"https://lagged.com/en/g/snake-vs-block-online","category":["Achievement Games","Skill Games","Snake Games","Arcade Games"],"content":"\n\nSnake vs Block Online is a fun and exciting game for all ages. Match up the same colored blocks to increase your score and surpass your friends' high scores. Avoid the colorful blocks, or you will lose size and momentum. Collect stars and improve your snake’s speed and length along the way! Challenge yourself and others to see who can get the highest score and become the ultimate snake master. Download now and join the fun!","howtoplay":"How to play: Click or tap and drag to control the snake","introduce":"Collect food to grow your snake as you avoid the big numbers blocks in your way. Your goal is to slither along for as long as possible without losing all of your body parts. Your strategy should be to eat the big foods while avoiding the blocks or running into low numbers blocks."},{"name":"Pizza Rush","description":"Play Pizza Rush game online at Lagged.com. Pizza Rush is one of our handpicked skill games that can be played on any device.","image":"/data_image/pizza-rush-game.jpg","source_html":"https://mobileassets.kizi.com/html5-games/98595/index.html","source_file":"https://lagged.com/en/g/pizza-rush","category":["Skill Games","Cooking Games","Food Games"],"content":"\n\nPizza Rush is an exciting and fast-paced game. Help the pizza delivery guy deliver pizzas on time in this awesome game. Drive through the city streets, avoiding obstacles, cars and other obstacles. Pick up the pizza boxes and deliver them to the customers before time runs out. Unlock new levels to earn more rewards as you reach each new milestone. Experience a fun challenge as you attempt to reach your target customer in each level. Join Pizza Rush now and get ready for an incredible ride!","howtoplay":"How to play: Move the food left if it belongs on a pizza. Use arrow keys or tap controls. ","introduce":"Help the chef out by moving the foods left or right. If the food belongs on a pizza move it to the left, if not move it to the right in the fridge. Be quick and try not to make any mistakes."},{"name":"Wheely 2","description":"Play Wheely 2 game online at Lagged.com. Wheely 2 is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/wheely-2-game.jpg","source_html":"https://html5.gamedistribution.com/68ac1f7590ef439e92765e4199779d65/","source_file":"https://lagged.com/en/g/wheely-2","category":["Puzzle Games","Car Games","Brain Games","Thinking Games"],"content":"\n\nWheely 2 is an awesome game for car lovers! Take control of this cute little car and help it navigate the obstacles in each level. Solve puzzles, trigger mechanisms and find hidden coins as you progress. You won't stop having fun with this game, where you need to find the right way to make Wheely get to the end of each level. Spend hours playing fun levels and colorful graphics. Help Wheely 2 make it home safely!","howtoplay":"How to play: Click or tap to move or stop the car","introduce":"Help the adorable red car escape from each of the levels. Avoid any bad obstacles as you drive through each of the levels."},{"name":"Hoops","description":"Play Hoops game online at Lagged.com. Hoops is one of our handpicked sports games that can be played on any device.","image":"/data_image/hoops-game.jpg","source_html":"https://lagged.com/api/play2/hoops2/","source_file":"https://lagged.com/en/g/hoops","category":["Achievement Games","Sports Games","Basketball Games","Ball Games"],"content":"\n\nHoops is a simple and addicting basketball game where you can test your shooting skills. Shoot as many hoops as you can and make the highest score. Take aim, adjust the force and firepower of your ball, and throw it towards the basket. Different sizes have different point-value. Aim for the bigger baskets to get more points. Don’t forget–time limits increase the difficulty. Try out Hoops, a fast-paced basketball game with tons of fun!","howtoplay":"How to play: Click or tap and drag to shoot the ball","introduce":"Shoot the ball towards the net and hope it goes in. If the ball hits the rim then goes in you score one point, if it goes in without hitting the rim you get two points. If you miss you have to start over! Improve your basketball shooting skills in this addicting game."},{"name":"Wire","description":"Play Wire game online at Lagged.com. Wire is one of our handpicked skill games that can be played on any device.","image":"/data_image/wire-game-i41.png","source_html":"https://html5.gamedistribution.com/c418646ba9c748ed95765343496310ab/","source_file":"https://lagged.com/en/g/wire","category":["Skill Games","Arcade Games"],"content":"\n\nWire is an exciting, challenging, and quick-paced game! Your objective is to carefully maneuver your wire inside the rhythm of the beats. Use precision to create symmetrical shapes, as fast as you can. But you must be careful, or you will quickly hit an obstacle. Test your reflexes and see how far you can get before the timer runs out! Wire is a great way to keep your mind sharp and have some fast-paced fun.","howtoplay":"How to play: Click or tap and hold to move the wire","introduce":"Avoid the dar obstacles as you move your wire up and down through the screen. Unlock new prizes and skins as you move forward in this super addicting online game. Sorry Bro!"},{"name":"Super Chef Burger","description":"Play Super Chef Burger game online at Lagged.com. Super Chef Burger is one of our handpicked girl games that can be played on any device.","image":"/data_image/super-chef-burger-game-9cw.jpg","source_html":"https://www.studiopowwow.com/clients/superChef9/","source_file":"https://lagged.com/en/g/super-chef-burger","category":["Girl Games","Cooking Games","Food Games","Poki Games"],"content":"\n\nCook and serve culinary masterpieces in Super Chef Burger! You are the head chef of your own burger restaurant, preparing and delivering delicious burgers for hungry customers. You'll have to be efficient and fast to make the right burgers and get them ready in time. Slice and dice vegetables, fry burgers on the griddle, and assemble the burger with the perfect combination of ingredients. Earn coins to upgrade your grilling tools, and make those burgers the top-notch specialty burger of your dreams!","howtoplay":"How to play: Click or tap to blend food","introduce":"Help the girl chef blend up the food to cook up a tasty burger. Follow the recipe or try to create your own tasty creation!"},{"name":"Hot Shot","description":"Play Hot Shot game online at Lagged.com. Hot Shot is one of our handpicked skill games that can be played on any device.","image":"/data_image/hot-shot-game.png","source_html":"https://lagged.com/api/play/hot-shot3/","source_file":"https://lagged.com/en/g/hot-shot","category":["Achievement Games","Skill Games","Arcade Games","Timing Games","Ball Games"],"content":"\n\nHot Shot is an exciting and intense basketball game that'll have you hooked in no time! In the fun 2D arcade style game, you take control of a highly skilled baller and attempt to make as many shots as possible. Bounce the ball off the walls and obstacles for an extra challenge. Hone your skills and challenge your friends to see who can get the highest score. Compete in a variety of single and multiplayer game modes to show off your skills. Enjoy the vibrant pixel art, catchy music and easy to pick up and play controls of Hot Shot now!","howtoplay":"How to play: Click or tap to shoot","introduce":"Your goal is to shoot and remove all of the white balls that are rotating around you. If you miss your shot you will lose a life, lose all 5 lives and it is game over! Make sure to aim perfectly and try to predict the movement of the outer circle. Top the leaderboards to prove you are a hot shooter."},{"name":"Drift Cup Racing","description":"Play Drift Cup Racing game online at Lagged.com. Drift Cup Racing is one of our handpicked racing games that can be played on any device.","image":"/data_image/drift-cup-racing-game.jpg","source_html":"https://play.famobi.com/drift-cup-racing/A-0D1OG","source_file":"https://lagged.com/en/g/drift-cup-racing","category":["Racing Games","Drift Games","Car Games","Driving Games"],"content":"\n\nDrift Cup Racing lets you be an adrenaline-charged racer and ride your way to the winner's podium. In this fast-paced and exciting 3D racing game, use your driving skills to drift around sharp corners while avoiding obstacles and other racers. Choose your car, customize it and race around 8 intense tracks. Compete against 15 other players and show them who's in charge by climbing the leaderboards and becoming the ultimate Drift Cup champion! With fast-paced gameplay, intuitive controls, and realistic visuals, Drift Cup Racing is a must-try!","howtoplay":"How to play: Arrow keys or tap controls to drive","introduce":"Join the elite drifting team as you race for the world cup. Drift through the corners and pass the other drivers so that you finish each of the races in first place. Upgrade your vehicle and continue the fun until you are crowned the champion."},{"name":"Odd One Out","description":"Play Odd One Out game online at Lagged.com. Odd One Out is one of our handpicked skill games that can be played on any device.","image":"/data_image/odd-one-out-game.jpg","source_html":"https://lagged.com/api/play/odd-one-out2/","source_file":"https://lagged.com/en/g/odd-one-out","category":["Achievement Games","Skill Games","Color Games","Timing Games","Brain Games"],"content":"\n\nOdd One Out is a fun and challenging game! Test your skills in this exciting game of difference spotting. Can you easily identify the odd one out between five opponents? Look carefully at all the shapes, colors and sizes to find the one that doesn't fit the pattern. Can you make it to the end and prove yourself a master at spotting differences? Challenge yourself with plenty of levels to play! Don't forget to concentrate and be the Odd One Out!","howtoplay":"How to play: Click or tap on the odd colored block","introduce":"Your goal is to quickly find the odd colored block out. Whichever block does not belong, that is the block that you want to tap. Quickly find the odd one out before the timer expires. Try to beat all 50 challenging levels!"},{"name":"Buggy Rally","description":"Play Buggy Rally game online at Lagged.com. Buggy Rally is one of our handpicked racing games that can be played on any device.","image":"/data_image/buggy-rally-gamee.jpg","source_html":"https://lagged.com/api/play/buggy-rally/","source_file":"https://lagged.com/en/g/buggy-rally","category":["Achievement Games","Racing Games","Car Games","Driving Games"],"content":"\n\nBuggy Rally is an electrifying 3D racing game where up to 4 players race each other in a bug rally. Join the rally with friends and race against the AI bug drivers for hours of intense racing fun. Try to be the first to reach the finish line and come out ahead of your competitors as you drift around tight corners and glide over massive jumps. Collect coins as you cruise around the rally's stages and upgrade your bug to get higher top speeds and faster acceleration to gain an edge over your opponents. So gear up and take your place at the starting line, it's time to show the world who the real Buggy Rally champion is!","howtoplay":"How to play: Arrow keys or tap controls to drive","introduce":"Race your offroad buggy up and down the hills towards the checkered flag. Drive your buggy up the hills without running out of gas. Earn stars, upgrade your vehicle and try to complete all of the levels. "},{"name":"Mini Race Rush","description":"Play Mini Race Rush game online at Lagged.com. Mini Race Rush is one of our handpicked racing games that can be played on any device.","image":"/data_image/mini-race-rush-game-lfe.jpg","source_html":"https://play.famobi.com/mini-race-rush/A-0D1OG","source_file":"https://lagged.com/en/g/mini-race-rush","category":["Racing Games","Car Games","Driving Games"],"content":"\n\nMini Race Rush is an exciting and addicting game that puts you in the driver's seat! In this game, you can choose from four different race cars to try and win the cup. The controls are intuitive and easy to understand, so you can jump right into the action. The visuals are also stunning and make it an immersive experience. Try your luck and see if you have what it takes to win the race! Put the pedal to the metal and join the Mini Race Rush today!","howtoplay":"How to play: Arrow keys or tap controls to drive","introduce":"Race around the table collecting as many stars as possible. Power up your vehicle as you gather cool items and avoid the other cars on the road. Keep driving around until the timer expires."},{"name":"Penalty Shooters","description":"Play Penalty Shooters game online at Lagged.com. Penalty Shooters is one of our handpicked sports games that can be played on any device.","image":"/data_image/penalty-shooters-game.jpg","source_html":"https://lagged.com/api/play2/penalty-shooters-2021a/","source_file":"https://lagged.com/en/g/penalty-shooters","category":["Sports Games","Soccer Games","Goal Games","World Cup Games","3d Games"],"content":"\n\nPenalty Shooters is a thrilling one-on-one soccer game where you can show your shooting and saving skills! It's fast-paced and straightforward: two players, five penalties each. Score more goals than your opponent in each mini-game to win the match. Are you ready to become a soccer star? Challenge your friends and become the Penalty Shooters champion!","howtoplay":"How to play: Click or tap to kick and to defend","introduce":"Select your league and then your team, then get ready to kick some butt in the penalty shootout! Try to score some goals against your opponent while defending the goal from their attempts. Try to shoot your way to the top of the tournament so you can be crowned the champion."},{"name":"Tile Blaster","description":"Play Tile Blaster game online at Lagged.com. Tile Blaster is one of our handpicked skill games that can be played on any device.","image":"/data_image/tile-blaster-game.jpg","source_html":"https://lagged.com/api/play/tile-blaster2/","source_file":"https://lagged.com/en/g/tile-blaster","category":["Achievement Games","Skill Games","Shooting Games","Arcade Games","Space Games","Gun Games"],"content":" \n\nTile Blaster is a fun and challenging game!Your goal is to connect and blast the same color tiles in order to eliminate them and clear the board. Enjoy the sounds, relaxing levels and lots of colorful tiles while playing. As you progress, the levels get increasingly challenging. Test your reaction skills, stay focused and see how fast you can blast tiles! Enjoy this lively and engrossing puzzle game with exciting levels that keeps you entertained for hours.","howtoplay":"How to play: Left arrow key or tap left to shoot Pink, Right arrow key or tap right to shoot Blue.","introduce":"Shoot your colored bullets at the same colored tiles to blast them away. Shoot either blue or pink bullets towards the tiles to blow them up before they reach your ship. Keep shooting away until you top the leaderboards and unlock all of the in game achievements."},{"name":"Streamline","description":"Play Streamline game online at Lagged.com. Streamline is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/streamline-game.jpg","source_html":"https://lagged.com/games/streamline/","source_file":"https://lagged.com/en/g/streamline","category":["Puzzle Games","Brain Games","Thinking Games","Snake Games"],"content":"\n\nPlay Streamline, an exciting and creative game for kids of all ages. In this fast-paced online space, you will compete with other players to collect as many items as possible along the dynamically changing path. Your aim is to test your reflexes and collect the most items, while dodging obstacles and obstacles along the way! Try all the levels and build your way up to the top. Challenge yourself and other players and become the ultimate Streamline champion!","howtoplay":"How to play: Swipe to move your line","introduce":"A relaxing tile based puzzle game where your goal is to move your box to the purple box in each level. Run into objects, avoid special boxes and make a line to the goal."},{"name":"Stickman Runner","description":"Play Stickman Runner game online at Lagged.com. Stickman Runner is one of our handpicked skill games that can be played on any device.","image":"/data_image/stickman-runner-game.jpg","source_html":"https://lagged.com/api/play2/stickman-runner3/","source_file":"https://lagged.com/en/g/stickman-runner","category":["Skill Games","Stickman Games","Running Games"],"content":"\n\nStickman Runner is an immensely fun and challenging game where you help your stickman character run and jump to the finish line! Beat tricky obstacle courses full of hurdles, spiked pits, and more. Speed up and slow down your runner to strategically pass through the game's various levels and earn coins along the way. With slick graphics, fast-paced gameplay, and increasing difficulty, you'll always find something new and exciting to explore. Download now and test your agility in this expertly crafted and addictively replayable game!","howtoplay":"How to play: Swipe up to jump, swipe down to slide","introduce":"Your goal is to Run, Jump and Roll through each of the stages. Avoid the obstacles and help your stickman run for as long as possible. There are three different stages you need to pass before you move to the next level."},{"name":"Robo Twins","description":"Play Robo Twins game online at Lagged.com. Robo Twins is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/robo-twins-game.jpg","source_html":"https://lagged.com/api/play/robo-twins3/","source_file":"https://lagged.com/en/g/robo-twins","category":["Achievement Games","Puzzle Games","Robot Games","Kid Games","Jumping Games","Platform Games"],"content":"\n\nRobo Twins is an action-packed side-scrolling platformer game that’s perfect for everyone. Team up with a friend and control two robots as you fight your way through the factory and confront a variety of mechanical adversaries. Collect colored orbs and use your wits to beat the 8 challenging levels. Add an extra flair to the game when you use the customizable robot attachments. The fast-paced controls will have you on the edge of your seat as you have fun with this exciting adventure. Get ready to experience action and excitement in Robo Twins!","howtoplay":"How to play: Arrow keys or tap to jump","introduce":"Help the two robot twins run through each of the levels. Four worlds with four levels each, can you complete all challenging 16 levels? Jump over gaps and avoid the obstacles as you collect energy pods and control both of the robots at the same time."},{"name":"Battlecoast","description":"Play Battlecoast game online at Lagged.com. Battlecoast is one of our handpicked strategy games that can be played on any device.","image":"/data_image/battlecoast-game.jpg","source_html":"https://static4.kizi.com/system/static/html5_games/1756/index.html","source_file":"https://lagged.com/en/g/battlecoast","category":["Strategy Games","Defense Games","War Games","Water Games"],"content":"\n\nBattleCoast is an epic boat battle game! Sail across the sea and take down other ships by bombing them with your cannons. Collect coins and rewards to purchase upgrades for your ship and customize it to become an unstoppable force. Upgrade your boat with bigger and more powerful cannons, shields, and other useful items. Engage in intense battles with other players and devise your own combat strategy. Challenge yourself and become the master sea captain in BattleCoast!","howtoplay":"How to play: Click or tap to aim and shoot","introduce":"Launch your weapons towards the advancing war ships. Defend your castle on the coast for as long as possible. Purchase upgrades to increase your chances of survival through the late stages."},{"name":"Twenty","description":"Play Twenty game online at Lagged.com. Twenty is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/twenty-game.jpg","source_html":"https://lagged.com/games/grade-papers/","source_file":"https://lagged.com/en/g/twenty","category":["Puzzle Games","Thinking Games","Brain Games","Cool Math Games"],"content":"\n\nTwenty is an addictive and fun game from Lagged.com! Put your math skills to the test as you make sums of 20 using the numbered cards. Unlock up to six decks of cards with more difficult sums. With three levels of difficulty, your challenge is to complete each board as fast as you can! Play solo or against friends to battle for the best score. Sharpen your math skills and have fun with Twenty!","howtoplay":"How to play: Click or tap and drag the tiles","introduce":"Try to add up the tiles to twenty. Combine the same numbers tiles to combine and add one. Try to clear the lines as quickly as possible before new lines are added and things become overwhelming."},{"name":"99 Balls Evo","description":"Play 99 Balls Evo game online at Lagged.com. 99 Balls Evo is one of our handpicked strategy games that can be played on any device.","image":"/data_image/99-balls-evo-game-mbq.jpg","source_html":"https://html5.gamedistribution.com/14a6a32cd96f4acaa04f5440ffe9a865/","source_file":"https://lagged.com/en/g/99-balls-evo","category":["Strategy Games","Ball Games","Arcade Games"],"content":"\n\n99 Balls Evo is a challenge for your reaction and coordination skills! Fire the ammo at the right angle and move quickly to shoot the descending balls. The faster you reach the target number, the higher your score will be. With an endless number of levels and an expansive library of skins, you can customize your ball color and unlock new features. Have a blast bouncing and destroying orbs in this action-packed and easy-to-play game!","howtoplay":"How to play: Tap or click to shoot","introduce":"More balls for you to shoot in this updated version to the popular game 99 Balls. Launch your white balls at the numbers balls above. Try to remove the colored balls to increase your own count until you can create a HUGE chain reaction."},{"name":"Go Fish","description":"Play Go Fish game online at Lagged.com. Go Fish is one of our handpicked skill games that can be played on any device.","image":"/data_image/go-fish-game.jpg","source_html":"https://lagged.com/api/play/go-fish/","source_file":"https://lagged.com/en/g/go-fish","category":["Skill Games","Fishing Games","Water Games"],"content":"\n\nGo Fish is a classic card game that's fun and easy to learn. Players match sets of 4 cards in order to get rid of their cards faster. The player with the most sets at the end of the game wins. It's great for kids and adults of all ages and playing with 2-5 players. There's no complicated rules, so it's the perfect game for a quick and fun pastime. Try it now and test your memory, as well as your luck in Go Fish.","howtoplay":"How to play: Click or tap to cast","introduce":"Try to reel in some tasty fish while avoiding crates and bombs at the bottom of the ocean. Your hook will swing back and forth, make sure to tap at just the right moment in order to catch some fish."},{"name":"Crazy Cabbie","description":"Play Crazy Cabbie game online at Lagged.com. Crazy Cabbie is one of our handpicked racing games that can be played on any device.","image":"/data_image/crazy-cabbie-game.jpg","source_html":"https://lagged.com/api/play/crazy-cabbie2/","source_file":"https://lagged.com/en/g/crazy-cabbie","category":["Achievement Games","Racing Games","Driving Games","Taxi Games","Avoiding Games"],"content":"\n\nCrazy Cabbie is an exciting and enjoyable racing game! Pick up passengers and get them to their destination as quickly as you can. Avoid obstacles, powerups, and shortcuts as you make your way around the city. Collect coins and upgrade your ride to become the best cabbie around. Race against the clock, beating your friends' scores and competing against other cabbies. Have a blast as you race around the city in Crazy Cabbie!","howtoplay":"How to play: Tap or use arrow keys to switch sides","introduce":"Drive vertically down the road and make sure you avoid all of the oncoming traffic! A new and unique twist to the classic Crazy Cabbie game series. Drive your taxi down the road while trying not to crash into any of the other vehicles."},{"name":"Hop","description":"Play Hop game online at Lagged.com. Hop is one of our handpicked skill games that can be played on any device.","image":"/data_image/hop-game.jpg","source_html":"https://lagged.com/api/play/hop2/","source_file":"https://lagged.com/en/g/hop","category":["Achievement Games","Skill Games","Arcade Games","Timing Games","Hard Games","Reaction Games"],"content":"\n\nHop on the classic game of hopping! This charming and exciting game features simple but addictive gameplay. Guide your character across a randomly-generated path filled with blocks and creative obstacles. Respond swiftly to the various jumps and hops that the path presents. Collect gems along the way and try to get the highest score. Enjoy the colorful, cheerful graphics and hop 'til your heart's content!","howtoplay":"How to play: Click or tap to hop","introduce":"Hop along as you play an odd looking eyeball character. Fall through or jump up through each of the rings to open the doors. Avoid running into the rings or the doors or it is game over. Keep moving forward perfecting your skills as the game speed increases."},{"name":"Snake and Blocks","description":"Play Snake and Blocks game online at Lagged.com. Snake and Blocks is one of our handpicked strategy games that can be played on any device.","image":"/data_image/snake-and-blocks-game.jpg","source_html":"https://lagged.com/api/play2/snake-and-blocks/","source_file":"https://lagged.com/en/g/snake-and-blocks","category":["Strategy Games","Snake Games","Arcade Games"],"content":"\n\nSnake and Blocks is a classic game-show-style puzzle game. Challenge your skills by guiding the snake around the board, collecting the right shapes and sizes to help you reach the target. Avoid being blocked by the obstacle blocks, or you won't be able to make it to the end. Enjoy the race to fit all the pieces of the puzzle as you beat the clock. Fun and exciting, Snake and Blocks will leave you wanting more. Try it now!","howtoplay":"How to play: Tap and hold then drag to move your snake","introduce":"Collect food and avoid the blocks for as long as possible. The longer you stay alive, the bigger the bricks will become. Eat up and grow big so you can survive for as long as possible."},{"name":"Spear Stickman","description":"Play Spear Stickman game online at Lagged.com. Spear Stickman is one of our handpicked skill games that can be played on any device.","image":"/data_image/spear-stickman-game.jpg","source_html":"https://lagged.com/api/play2/spear-stickman-db3/","source_file":"https://lagged.com/en/g/spear-stickman","category":["Achievement Games","Skill Games","Stickman Games","Arcade Games","Archery Games"],"content":"\n\nSpear Stickman is a one-of-a-kind fast-paced game where you must shoot a spear to defeat the various enemies you encounter. Make sure to aim precisely because there's only one shot! The environments are constantly changing, giving you an enriching experience. Score points by knocking out multiple enemies with one glide of your spear and make your way to the higher levels. Have fun as you take on thrilling challenges full of captivating action!","howtoplay":"How to play: Click or tap and hold to aim and throw your spear","introduce":"Armed with just a spear, try to take down as many opponents as possible before they bring you down. Unlock helmets and armor to help you survive longer in this super addicting spear throwing game. Try to get a headshot to earn more coins."},{"name":"Ninja Treasure","description":"Play Ninja Treasure game online at Lagged.com. Ninja Treasure is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/ninja-treasure-game.jpg","source_html":"https://lagged.com/api/play/ninja-treasure/","source_file":"https://lagged.com/en/g/ninja-treasure","category":["Achievement Games","Puzzle Games","Ninja Games","Thinking Games","Brain Games"],"content":"\n\nNinja Treasure is a fun and exciting online platformer game. Take control of a brave ninja as you make your way through challenging levels and collect the hidden treasures. Guide the ninja through the tricky obstacles and stay sharp to avoid dangerous falls. Collect coins and stars to earn bonuses and upgrades. With its vibrant graphics and exciting levels, Ninja Treasure is an addicting and fun game for all ages. Try your luck and see if you have what it takes to be a ninja master!","howtoplay":"How to play: Arrow keys or tap controls to move the ninja","introduce":"Sokoban style puzzle game where your goal is to move the crates onto the stars to unlock the treasure in each level. Think ahead then move the boxes around until all of the boxes are on top of the stars. If you get stuck you can back track your moves or completely restart the level."},{"name":"Frozen Rush","description":"Play Frozen Rush game online at Lagged.com. Frozen Rush is one of our handpicked skill games that can be played on any device.","image":"/data_image/frozen-rush-game-online.jpg","source_html":"https://lagged.com/api/play2/frozen-rush/","source_file":"https://lagged.com/en/g/frozen-rush","category":["Achievement Games","Skill Games","Running Games","Elsa Games","Cartoon Games","Kid Games"],"content":"\n\n\nFrozen Rush is an exciting new game that will have you running and sliding your way across icy obstacles. With many treacherous levels available, you will have endless fun racing against the clock to make it to the finish line. Customize the look of your player and compete with players around the world for the best time! Stop the clock and show off your icy skills in this exhilarating game. Join in on the Frozen Rush now!","howtoplay":"How to play: Click or tap to jump. Enter key or tap on the left to use special abilities.","introduce":"Help the characters from Frozen run through each of the levels, collecting crystals and avoiding all of the obstacles. Complete 3 levels in Story mode to unlock Endless mode in order to save high scores. Keep running along as you try to upgrade your skills and complete all of the levels."},{"name":"Goal Champion","description":"Play Goal Champion game online at Lagged.com. Goal Champion is one of our handpicked sports games that can be played on any device.","image":"/data_image/goal-champion-game-ull.jpg","source_html":"https://play.famobi.com/goal-champion/A-0D1OG","source_file":"https://lagged.com/en/g/goal-champion","category":["Sports Games","Soccer Games","Goal Games","World Cup Games","Ball Games"],"content":"\n\nReach new heights with Goal Champion! This exciting soccer game offers players a chance to challenge both their opponents and themselves. Draw up a strategy, position your defenders and midfielders, and take your shot at goal while trying to keep the other team out of the box. Play on multiple game modes, such as against the clock, career mode and tournaments to ensure that the game never gets boring and to increase your overall skill level. Whether you are new to the sport or an experienced player, head to the pitch and show the world your footballing prowess with Goal Champion!","howtoplay":"How to play: Click or tap to kick the ball","introduce":"Become the best goal kicker in the world! Prove your skills by mastering all three leagues and beating 24 different teams. Move the aimer to determine your kick angle, then tap when the power bar is at a good location."},{"name":"Birdy Rush","description":"Play Birdy Rush game online at Lagged.com. Birdy Rush is one of our handpicked skill games that can be played on any device.","image":"/data_image/birdy-rush-game-uqe.jpg","source_html":"https://play.famobi.com/birdy-rush/A-0D1OG","source_file":"https://lagged.com/en/g/birdy-rush","category":["Skill Games","Arcade Games","Bird Games"],"content":"\n\nBirdy Rush is an exciting arcade game that will challenge you to test your reflexes! Control your bird as you race through different levels dodging enemies and collecting coins. Clear the course in the fastest time and get higher scores! Fly through the air, collect tasty fruits and navigate dangerous obstacles like snake blocks. Show off your skills and see how far you can get before the timer runs out. Enjoy this fast-paced, colorful game and take your gaming skills to the next level!","howtoplay":"How to play: Click or tap to move the bird","introduce":"Avoid the falling crates for as long as possible. Try not to get squished as you help your cute little birdy move along the boxes, keeping an eye out for any falling boxes from the sky. How long can you survive?"},{"name":"Jelly Splash","description":"Play Jelly Splash game online at Lagged.com. Jelly Splash is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/jelly-splash-game.jpg","source_html":"https://play.famobi.com/jelly-collapse/A-0D1OG","source_file":"https://lagged.com/en/g/jelly-splash","category":["Achievement Games","Puzzle Games","Matching Games","Chain Reaction Games","Colored Blocks Games"],"content":"\n\nJelly Splash is an exciting puzzle game that will stimulate your brain. Create long chains of jelly balls by matching 3 or more of the same color. Unlock special powers and new levels as you progress. Get ready for hours of unique and intriguing fun! You will be fully absorbed in this amazing world full of bright and vibrant colors. With plenty of levels and extras to explore, Jelly Splash is guaranteed to provide you with hours of challenging fun.","howtoplay":"How to play: Click or tap to match groups of jellies","introduce":"Match 3 or more of the same colored jellies to remove them from play. Adventure the land collecting stars and unlocking new levels. Use special abilities to help you reach each goal in each of the levels."},{"name":"Basketball Shooting","description":"Play Basketball Shooting game online at Lagged.com. Basketball Shooting is one of our handpicked sports games that can be played on any device.","image":"/data_image/basketball-shooting-game.jpg","source_html":"https://lagged.com/api/play2/basketball-shooting2/","source_file":"https://lagged.com/en/g/basketball-shooting","category":["Achievement Games","Sports Games","Basketball Games","Ball Games"],"content":"\n\nBasketball Shooting is an exciting game that will keep you on your toes. Aim your shots, boost your score and determine who will take the crown as the best shooter. You'll need to flick your finger just right to make the ball curve around the basket and earn the multiplier bonus. Every level brings a new challenge and with several game modes, you can play how you want. Show your friends who's the best with Basketball Shooting!","howtoplay":"How to play: Click or tap and drag to aim and shoot","introduce":"Grab the basketball and shoot it towards the hoop. If you miss the basket you lose a life, lose all lives and it is game over. Avoid defenders and aim the ball just right so you get nothing but net. A very fun basketball shooter game that gets increasingly difficult the more baskets you make."},{"name":"Moorhuhn Soccer","description":"Play Moorhuhn Soccer game online at Lagged.com. Moorhuhn Soccer is one of our handpicked sports games that can be played on any device.","image":"/data_image/moorhuhn-soccer-game-rvb.jpg","source_html":"https://html5.gamedistribution.com/8f1a09c833e04627ae3d99cc4456dc6f/","source_file":"https://lagged.com/en/g/moorhuhn-soccer","category":["Sports Games","Soccer Games","Goal Games","World Cup Games"],"content":"\n\nMoorhuhn Soccer is a soccer-themed game which is sure to keep you entertained. Control your soccer team and help them become the best in the world. Strategically pass the ball and show off your skills to win each soccer match. With vivid cartoon graphics and background music, the game creates a fun and exciting experience. Play with up to 3 friends and be the best of the best by scoring the most points over the course of the season. Show off your skills and become a fan favorite!","howtoplay":"How to play: Click and tap and hold to jump and kick","introduce":"Help this rooster do some backflips and kick the balls into the goal. Try to score as many goals as possible within the time limit to earn the most points possible."},{"name":"True Number","description":"Play True Number game online at Lagged.com. True Number is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/true-number-game.jpg","source_html":"https://lagged.com/api/play/true-number/","source_file":"https://lagged.com/en/g/true-number","category":["Achievement Games","Puzzle Games","Cool Math Games","Brain Games","Thinking Games"],"content":"\n\nTrue Number is an addicting and fun-filled math game! Test your skills in this fast-paced, one-on-one showdown to see who can find the true number first. Think strategically and keep an eye out for the right numbers. Compete with your friends to see who can calculate the fastest and win the most rounds. With colorful graphics, exciting animations and a challenging yet exciting game play, True Number will keep you entertained for hours! So come on, give it a try and see how far you can go!","howtoplay":"How to play: Click or tap on the correct answer","introduce":"Quickly solve the math problems before the timer expires. If you answer any questions wrong it is automatically game over. Try to correctly answer each quest as fast as possible in this fun quick math game."},{"name":"Pile Up","description":"Play Pile Up game online at Lagged.com. Pile Up is one of our handpicked skill games that can be played on any device.","image":"/data_image/pile-up-game.jpg","source_html":"https://lagged.com/api/play/pile-up/","source_file":"https://lagged.com/en/g/pile-up","category":["Achievement Games","Skill Games","Stacking Games","Tower Games","Arcade Games"],"content":"\n\nPile Up is an easy to play yet challenging puzzle game! Reach the top of the tower before it collapses by piling blocks on top of each other. Find the right balance with every tower and make sure you don't crash on your way up! Fun, fast and easy gameplay makes it captivating and perfect for when you have a few minutes of free time. Compete with friends and family to see who can get the highest score and build the tallest tower!","howtoplay":"How to play: Arrow keys or tap to build the tower. Do not stack two of the same colors together.","introduce":"Grow your tower by pilling up the blocks on top of each other. Do not stack two of the same colored blocks together or it is game over! Stack the tower up fast to unlock a new timer or you will run out of time."},{"name":"Archery Battle","description":"Play Archery Battle game online at Lagged.com. Archery Battle is one of our handpicked action games that can be played on any device.","image":"/data_image/archery-battle-game.jpg","source_html":"https://lagged.com/api/play2/archery-battle-db/","source_file":"https://lagged.com/en/g/archery-battle","category":["Achievement Games","Action Games","Archery Games","Shooting Games","Stickman Games"],"content":"\n\nArchery Battle is an action-packed game that gives you the opportunity to play bow and arrow in an epic battle. Enjoy the fun and exciting game mode of duels, 1v1 and 2v2 battles. Compete against friends or other opponents to prove that you are the top archer. You can customize your clothing and equipment, improve your skills to increase your chances of success. Face the challenge, improve your accuracy and become the champion of Archery Battle!","howtoplay":"How to play: Click or tap and drag to aim and shoot arrows","introduce":"Launch your arrows towards your opponents in this super fun and addicting online stickman archery battle. Aim for the head for bonus points. Be quick and hope your aim is great as you rain your arrows down on your challengers. Take out as many stickmen as possible before they take you down."},{"name":"Bouncy Rush","description":"Play Bouncy Rush game online at Lagged.com. Bouncy Rush is one of our handpicked skill games that can be played on any device.","image":"/data_image/bouncy-rush-game.jpg","source_html":"https://lagged.com/api/play/bouncy-rush4/","source_file":"https://lagged.com/en/g/bouncy-rush","category":["Achievement Games","Skill Games","Platform Games","Jumping Games"],"content":"\n\nBouncy Rush is an exciting and fast-paced game! Test your reflexes by tapping left and right quickly to keep the ball moving on the platform. Avoid obstacles, collect coins and gems, and reach the highest level to beat your friends' high score! With colorful environments, thrilling power-ups, responsive controls, and unlimited levels, you're sure to have a blast with Bouncy Rush. Challenge yourself and see how far you can go!","howtoplay":"How to play: Click or tap to change gravity","introduce":"Help your character bounce along the platforms while switching the gravity. Collect coins and avoid the saws as you try to bounce as far as possible. Use your coins to unlock new skins to help you unlock all of the in game achievements."},{"name":"LA Rex","description":"Play LA Rex game online at Lagged.com. LA Rex is one of our handpicked action games that can be played on any device.","image":"/data_image/la-rex-game.jpg","source_html":"https://html5.gamedistribution.com/25a66b4cf54245c88237c7e5a154f315/","source_file":"https://lagged.com/en/g/la-rex","category":["Action Games","Eating Games","Bloody Games","Attack Games"],"content":"\n\nLa Rex is an exciting and fast paced game. Take control of the hungry T-Rex as he scurries around town causing mayhem and destruction. Run through the city, eating cars, avoiding obstacles, and snatching humans to satisfy your appetite. Enjoy fun physics-based gameplay and fast-paced action while you work your way up the leaderboard and compete against your friends. Test your skills and reflexes as you dash around town, eating, running and jumping your way to victory. Enjoy La Rex and see if you have what it takes to survive!","howtoplay":"How to play: WAD keys to move, Click to eat, or use tap controls on mobile","introduce":"Help your T-Rex go on a rampage across Los Angeles. Run along the city chasing the scared humans, eating them any chance you get. The dinosaur is loose and is very hungry, help him devour all of the running men and women in this HTML5 version of the popular flash game."},{"name":"Dangerous Cargo","description":"Play Dangerous Cargo game online at Lagged.com. Dangerous Cargo is one of our handpicked racing games that can be played on any device.","image":"/data_image/dangerous-cargo-game.jpg","source_html":"https://lagged.com/api/play/dangerous-cargo2/","source_file":"https://lagged.com/en/g/dangerous-cargo","category":["Achievement Games","Racing Games","Truck Games","Driving Games"],"content":"\n\nDangerous Cargo is an addictive and action-packed game! Test your skills as a truck driver and complete challenging levels while transporting dangerous cargo. Avoid crashing and deliver your cargo as fast as you can while weaving in and out through the dense urban landscape. Upgrade your rig, unlock new features, and collect achievements to become the best truck driver! Challenge yourself and your friends to see who can be the best driver and deliver the most dangerous cargo.","howtoplay":"How to play: Arrow keys or tap controls to drive","introduce":"Drive along the road nice and steady on your way to the finish line. Try to keep as much of the cargo in the back of your truck as you drive up and over different obstacles. You have 2 minutes to get to your goal with at least one box on your truck to finish the game."},{"name":"Mahjong Frenzy","description":"Play Mahjong Frenzy game online at Lagged.com. Mahjong Frenzy is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/mahjong-frenzy-game.jpg","source_html":"https://games.softgames.de/mahjong-frenzy/?locale=en&p=pub-12406-12406","source_file":"https://lagged.com/en/g/mahjong-frenzy","category":["Puzzle Games","Mahjong Games","Matching Games","Soft Games"],"content":"\n\nMahjong Frenzy is an exciting and fun puzzle game. Play with mahjong tiles to match identical tiles and clear each level. Unlock new tile patterns and solve intricate puzzles. Enjoy over 1000 levels of fascinating gameplay and sharpen your skills in this classic tile-matching game. Strive to achieve three stars on every level to reach bonus stages and increase your score. Play Mahjong Frenzy and test your puzzle-solving skills!","howtoplay":"How to play: Click or tap to match and remove tiles","introduce":"Go crazy with this new mahjong game. Match the same tiles together to remove them from play. Remove all of the tiles to complete each of the puzzles. Come back daily for prizes and new puzzles."},{"name":"Circle Traffic","description":"Play Circle Traffic game online at Lagged.com. Circle Traffic is one of our handpicked strategy games that can be played on any device.","image":"/data_image/traffic-circle-game.jpg","source_html":"https://lagged.com/api/play/circle-traffic2/","source_file":"https://lagged.com/en/g/circle-traffic","category":["Achievement Games","Strategy Games","Traffic Games","Reaction Games","Brain Games"],"content":"\n\nCircle Traffic is an exhilarating race to escape the chaos! Guide different wheeled vehicles around each level's traffic circles without crashing into each other. It's fast-paced and fun - timing is the key! Use power-ups to finish the levels as fast as you can. The game is simple, yet addicting. See if you can beat the traffic with Circle Traffic!","howtoplay":"How to play: Click or tap to rotate the path","introduce":"Help guide the circles to the correct pod as they flow out from the top. If you get the colors wrong then it is game over. The circle traffic increases over time making this game extremely difficult. Master your skills in order to top the leaderboards!"},{"name":"Soccer Bubbles","description":"Play Soccer Bubbles game online at Lagged.com. Soccer Bubbles is one of our handpicked sports games that can be played on any device.","image":"/data_image/soccer-bubbles-game-t3x.jpg","source_html":"https://play.famobi.com/soccer-bubbles/A-0D1OG","source_file":"https://lagged.com/en/g/soccer-bubbles","category":["Sports Games","Bubble Games","Matching Games","Soccer Games"],"content":"\n\nSoccer Bubbles is an exciting and challenging match-3 game that brings a unique twist to the classic genre. Enjoy endless levels of strategic matching fun as you pass through each stage. Match the same colors together to connect the bubbles and clear the stage. Strategize which moves to make to work your way up to a higher score. Enjoy a completely unique Match-3 experience with Soccer Bubbles!","howtoplay":"How to play: Click or tap to shoot","introduce":"Match 3 or more of the same colored balls in this unique twist to the bubble shooter genre. Kick the balls into the sky and try to clear the entire board before the balls come crashing down on you."},{"name":"Fidget Spinner Pro","description":"Play Fidget Spinner Pro game online at Lagged.com. Fidget Spinner Pro is one of our handpicked skill games that can be played on any device.","image":"/data_image/fidget-spinner-pro-game.jpg","source_html":"https://lagged.com/api/play/fidget-spinner-pro/","source_file":"https://lagged.com/en/g/fidget-spinner-pro","category":["Achievement Games","Skill Games","Fidget Spinner Games","Upgrade Games","Timing Games","Arcade Games"],"content":"\n\nTake your spinning to the next level with Fidget Spinner Pro! Give your wrist a rest and spin a virtual fidget for stress relief and fun. Unlock tons of new designs and spinners by scoring big and earning coins. Compete against other players to become the spin master. Challenge your friends to see who can spin the longest. Enjoy the simplicity of the game and relax while racking up the coins. With no age limit, Fidget Spinner Pro has something for everyone!","howtoplay":"How to play: Swipe to spin","introduce":"Level up your fidget spinner by purchasing upgrades, increasing your multiplier and unlocking new skins. Prove to the world that you are a fidget spinning pro in this new game. 11 different skins to unlock, simply swipe to spin the stress relief toy."},{"name":"Stick Golf","description":"Play Stick Golf game online at Lagged.com. Stick Golf is one of our handpicked sports games that can be played on any device.","image":"/data_image/stick-golf-game.jpg","source_html":"https://lagged.com/api/play2/stick-golf2/","source_file":"https://lagged.com/en/g/stick-golf","category":["Achievement Games","Sports Games","Golf Games","Stickman Games","Mini Golf Games","Putt Putt Games"],"content":"\n\nStick Golf is an engaging and fun golf game. Play your way through 18 diverse courses, each with its own set of challenges. With intuitive one-touch controls and easy to understand gameplay, anyone can become a mini-golf virtuoso in minutes. Compete with other players around the world to become the Stick Golf Master, or just play the game for a relaxed, easy-going adventure. Customize your avatar and get ready for a challenging and rewarding golf experience!","howtoplay":"How to play: Click or tap to swing club","introduce":"Try to sink as many balls into the hole as you possibly can. Hold down to increase your swing power then let go to watch the ball fly. Adjust your power as you aim for the hole in each round. See how high of a score you can achieve with 10 balls."},{"name":"Duo Cards","description":"Play Duo Cards game online at Lagged.com. Duo Cards is one of our handpicked strategy games that can be played on any device.","image":"/data_image/duo-cards-game-zwx.jpg","source_html":"https://play.famobi.com/duo-cards/A-0D1OG","source_file":"https://lagged.com/en/g/duo-cards","category":["Strategy Games","Card Games","Arcade Games"],"content":"\n\nDuo Cards is the ultimate super-fun card game to challenge yourself and your friends! Compete to be the best at the classic draw and discard game - the objective is to make sets of two or more cards of the same number. It’s fast-paced, challenging and addicting! Play with your friends online and compare your points to see who comes out on top. Test your skills with this modern twist on a classic game. Try Duo Cards now!","howtoplay":"How to play: Click or tap to play cards","introduce":"Be the first player to get rid of all of the cards in your hand to win the game. Similar rules to the card game UNO, place the same colored or same numbered card onto the pile. Skip, reverse and play wilds strategically until you are declared the winner."},{"name":"Starblast.io","description":"Play Starblast.io game online at Lagged.com. Starblast.io is one of our handpicked action games that can be played on any device.","image":"/data_image/starblast-io-game-4w4.jpeg","source_html":"https://starblast.io/gd.html","source_file":"https://lagged.com/en/g/starblast-io","category":["Action Games","Space Games",".io Games","Multiplayer Games"],"content":"\n\nStarblast.io is an action-packed online game that’ll have you shooting to the top! Pilot around a 3D galaxy in your own custom spaceship, then fly close and fire away! Upgrade your ship and take on your enemies in thrilling PVP or co-op battles. Drive away opponents with powerful special weapons, rule the leaderboard, and conquer the galaxy! Become the ultimate space warrior and show the universe who’s boss!","howtoplay":"How to play: Click or tap to move and shoot","introduce":"A massive multiplayer game that takes place in space. Harvest gems to upgrade your stats, then search and destroy an enemy space ships. Climb the leaderboard as you attempt to be the best in the universe."},{"name":"Fast Math","description":"Play Fast Math game online at Lagged.com. Fast Math is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/fast-math-games.jpg","source_html":"https://lagged.com/api/play/fast-math3/","source_file":"https://lagged.com/en/g/fast-math","category":["Achievement Games","Puzzle Games","Cool Math Games","Brain Games"],"content":"\n\nFast Math is a fun and addictive math game that puts your math skills to the test! You will be presented with simple equations and you must answer them within the given period of time. Answer each equation correctly and you will proceed to the next level! Test your math skills and keep your mind sharp with Fast Math! Challenge yourself and compete against your friends for the highest score. Challenge your brain today and show your friends who is the math king!","howtoplay":"How to play: If the math problem is correct tap on the correct button, or incorrect button if it is incorrect.","introduce":"Try to answer as quickly as possible as you determine if the math questions are correct or incorrect. The higher your score the faster the timer will go. If you get any questions wrong then it is game over!"},{"name":"Make7","description":"Play Make7 game online at Lagged.com. Make7 is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/make-7-game.jpg","source_html":"https://lagged.com/api/play/Make7-2/","source_file":"https://lagged.com/en/g/make7","category":["Achievement Games","Puzzle Games","Thinking Games","Brain Games"],"content":"\n\nMake7 is a puzzle game that will put your brain to the test. The goal is to make 7 out of the numbers given. Do this across 10 levels, and make sure to beat the clock to move up! Match hexagons in the most effective way while earning combos and points as you go. Take on new challenges by completing the game in the least amount of moves possible. Sharpen your logical skills and give Make7 a try!","howtoplay":"How to play: Drag and drop the tiles to the board. Combine 3 or more of the same numbered tiles to combine.","introduce":"Keep combining the tiles together trying to work your way up to 7 to remove the tile from play. Keep playing until you fill up the entire board. The more tiles you combine the higher your score will be."},{"name":"Caveman Hunt","description":"Play Caveman Hunt game online at Lagged.com. Caveman Hunt is one of our handpicked skill games that can be played on any device.","image":"/data_image/caveman-hunt-game-alt3.jpg","source_html":"https://lagged.com/api/v2/games/caveman-hunt2/","source_file":"https://lagged.com/en/g/caveman-hunt","category":["Achievement Games","Skill Games","Distance Games","Caveman Games","Upgrade Games"],"content":"\n\nEmbark on an exciting journey in Caveman Hunt and explore a prehistoric venue full of danger! Jump and duck to overcome deep pits, collect fruits to increase your score and encounter wild animals. Try to beat your highest score as you progress through increasingly difficult levels and make sure you don't get caught. Showcase your agility and skills with Caveman Hunt, an addictive and fun platform game that everyone can enjoy!","howtoplay":"How to play: Click or tap to launch the hunter","introduce":"Go hunting for some woolly mammoth meat! Launch the hunter into the air and try to gain enough speed so that you catch up to your dinner. Upgrade your skills and stats so that you can travel further with each attempt. Improve your technique so you can put some food on the table for your cave family."},{"name":"Merge Thirteen","description":"Play Merge Thirteen game online at Lagged.com. Merge Thirteen is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/merge-thirteen-game-z2m.jpg","source_html":"https://games.softgames.de/merge-thirteen/?locale=en&p=pub-12406-12406","source_file":"https://lagged.com/en/g/merge-thirteen","category":["Puzzle Games","Matching Games","Brain Games"],"content":"\n\nMerge Thirteen is an addictive puzzle game that’s easy to learn and play! Arrange the numbered tiles into ascending order, by combining numbers to create new ones. Complete each level with the least number of moves possible and challenge yourself to beat your best score. Trying to beat your time? Compete with friends and family to see who can solve the puzzle the fastest and become the king of Merge Thirteen!","howtoplay":"How to play: Click or tap and drag to select numbers","introduce":"Combine the similar numbers together to merge them together into a high number. Keep matching the numbers together until you reach 13."},{"name":"Flappy 360","description":"Play Flappy 360 game online at Lagged.com. Flappy 360 is one of our handpicked skill games that can be played on any device.","image":"/data_image/flappy-360-game.jpg","source_html":"https://lagged.com/api/play/flappy-3603/","source_file":"https://lagged.com/en/g/flappy-360","category":["Achievement Games","Skill Games","Arcade Games","Reaction Games","Hard Games"],"content":"\n\nFlappy 360 is an addicting and fun arcade game that will keep you glued to your screen! Help the ball navigate through various spinning gates by pressing the spacebar. Timing is key, as you'll have to control the movement of the ball and time each spacebar press exactly right. You'll have to think fast and act faster if you want to make it to the next level! Play through challenging levels, beat your high score, and see if you can master this addicting game. Try Flappy 360 now and see if you have what it takes to overcome the spinning gates!","howtoplay":"How to play: Click or tap to jump","introduce":"Jump through the walls as you rotate around the circle. As your score increases the walls will begin to rotate and then speed up. Keep jumping and avoiding the moving walls as you rotate the globe, trying to top the leaderboards with a big score."},{"name":"Free Words","description":"Play Free Words game online at Lagged.com. Free Words is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/free-words-game.jpg","source_html":"https://lagged.com/api/play/free-words/","source_file":"https://lagged.com/en/g/free-words","category":["Achievement Games","Puzzle Games","Word Games","Brain Games","Thinking Games","Quiz Games"],"content":"\n\nFree Words is an exciting word game where vocabulary meets puzzle solving! It's simple to play, but difficult to master. Your goal is to make words from the given letters, with each word earning you points towards the goal. Challenge your brain and come up with as many words as you can in a limited time. Try it now and see how your score ranks among the best in the world!","howtoplay":"How to play: Try to spell different words as quickly as possible. Type or tap on the letters to put them into play.","introduce":"You have 60 seconds to spell out as many words as possible using the letters available. Quickly spell out words then hit enter to submit your word. The more words you spell the higher your score. Try to top the leaderboards and show the world you are a word genius!"},{"name":"Mario Maker","description":"Play Mario Maker game online at Lagged.com. Mario Maker is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/mario-maker-games.jpg","source_html":"https://lagged.com/games/play2/mario-maker7/","source_file":"https://lagged.com/en/g/mario-maker","category":["Puzzle Games","Arcade Games","Platform Games","Building Games"],"content":"\n\nMario Maker is an awesome game where you can create your own levels featuring the classic-style Mario graphics! You can also play levels created by other players. Using a variety of tools, you can design your own masterpiece built around Mario and his surroundings. Challenge yourself and your friends to beat difficult user-generated levels, or share your own with the world. Play this exciting game today and make your own Mario adventure!","howtoplay":"How to play: Desktop controls: Arrow keys to move, Shift to run, Spacebar to shoot.\nMobile/Tablet controls: Tap left side to move left or right. Swipe up on right side to jump.","introduce":"Build your very own Mario levels and share them with the world. A very fun fan game where you can design different levels and then put them to the test. Share your code with friends and see if they can pass the levels that you create."},{"name":"Elevator Ball","description":"Play Elevator Ball game online at Lagged.com. Elevator Ball is one of our handpicked skill games that can be played on any device.","image":"/data_image/elevator-ball-game.jpg","source_html":"https://lagged.com/api/play/elevator-ball/","source_file":"https://lagged.com/en/g/elevator-ball","category":["Skill Games","Arcade Games","Ball Games","Hard Games","Balance Games"],"content":"\n\nElevator Ball is a unique, daring and exciting game. Move the ball left and right while dodging the obstacles as it goes up in an endless elevator. Unleash your skills by gaining speed and reaching the top of the scoreboard. Time your moves precisely to reflect the obstacles and reach the highest score ever. Enjoy this fun and challenging game with your friends, and show off your amazing reflexes.","howtoplay":"How to play: A,Z and K,M keys or Tap and hold to control the elevator","introduce":"Roll the ball back and forth and up and down trying to avoid the doors. Balance the ball on the elevator and make sure to avoid the holes for as long as possible. The higher you climb up into the air, the higher your score will be."},{"name":"Neon Jump","description":"Play Neon Jump game online at Lagged.com. Neon Jump is one of our handpicked skill games that can be played on any device.","image":"/data_image/neon-jump-game.jpg","source_html":"https://lagged.com/api/play/neon-jump/","source_file":"https://lagged.com/en/g/neon-jump","category":["Skill Games","Platform Games","Jumping Games"],"content":"\n\nJump between platforms and dodge obstacles in Neon Jump! This thrilling game requires both skill and agility to make it to the top. With a vibrant neon glow, each game is colorful and fun. Jump and weave your way through the platforms, collecting gems and watching out for obstacles. Compete on the leaderboards and climb the rankings to be the best Neon Jump player. Challenge yourself and test your reflexes in the world of Neon Jump!","howtoplay":"How to play: Arrow keys or tap and hold to move your circle","introduce":"Jump from platform to platform as you try to jump high into the air. Keep climbing to increase your score as you leap from neon colored platform to the next. Very fun and addicting high score game."},{"name":"Momo Pop","description":"Play Momo Pop game online at Lagged.com. Momo Pop is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/momo-pop-game-ixi.jpg","source_html":"https://play.famobi.com/momo-pop/A-0D1OG","source_file":"https://lagged.com/en/g/momo-pop","category":["Puzzle Games","Matching Games","Animal Games","Cute Games"],"content":"\n\nMomo Pop is a unique and vibrant matching game where you can test your puzzle-solving skills. Move and match the colorful pieces of Momo, the brave monkey, and his friends. Gain points and earn stars as fast as you can to complete levels, unlocking new challenges and unlocking sweet rewards. Enjoy beautiful and exciting animations with every match you make, as you go on an adventure with Momo. Have fun and prove your puzzle-solving skills with Momo Pop!","howtoplay":"How to play: Click or tap to swap animals","introduce":"Match 3 or more of the same animals to remove them from play. A super fun and cute matching game where you need to match together farm animals."},{"name":"Shape Fitting","description":"Play Shape Fitting game online at Lagged.com. Shape Fitting is one of our handpicked skill games that can be played on any device.","image":"/data_image/shape-fitting-game.jpg","source_html":"https://lagged.com/api/play/shape-fitting3/","source_file":"https://lagged.com/en/g/shape-fitting","category":["Achievement Games","Skill Games","Arcade Games","Logic Games","Timing Games"],"content":"\n\nShape Fitting is a fun, yet challenging puzzle game with a colorful interface that's sure to keep you entertained. Players must fit the randomly generated shapes into the outline without overlapping. Experiment with different placements and test your logic skills in this enjoyable brain-teaser. With 20 increasingly difficult levels, Shape Fitting is sure to provide hours of gaming pleasure. Try it now and see how many correct fits you can manage to get!","howtoplay":"How to play: Click or tap to grow the shapes","introduce":"Grow your shapes so that they fit snuggly into the parent shape. Time it just right so that the shapes match together to earn anywhere from 1 to 3 points. Tap at just the correct time to fit the shapes."},{"name":"Zombie Run Saga","description":"Play Zombie Run Saga game online at Lagged.com. Zombie Run Saga is one of our handpicked strategy games that can be played on any device.","image":"/data_image/zombie-run-saga-game.jpg","source_html":"https://lagged.com/api/play/zombie-run-saga2/","source_file":"https://lagged.com/en/g/zombie-run-saga","category":["Achievement Games","Strategy Games","Zombie Games","Avoiding Games"],"content":"\n\nZombie Run Saga is an exciting, fast-paced game with non-stop action. Help the brave zombie avoid obstacles and collect coins while running around the beautiful world. Enjoy visual effects that bring the zombie to life and challenge yourself to complete the levels in record time. Use awesome power-ups to increase your score and achieve a high rank. Get ready to join the zombie fun!","howtoplay":"How to play: Click or tap and hold and drag to move your zombie","introduce":"Eat the brains while avoiding the bullets from the plants. A brand new Plants vs Zombies themed game where you need to try to survive for as long as possible. Move around dodging all of the plant bullets as you try to eat as many brains as possible to get a high score."},{"name":"Zig Up","description":"Play Zig Up game online at Lagged.com. Zig Up is one of our handpicked skill games that can be played on any device.","image":"/data_image/zig-up-game.jpg","source_html":"https://lagged.com/api/play/zig-up/","source_file":"https://lagged.com/en/g/zig-up","category":["Achievement Games","Skill Games","Arcade Games","Distance Games","Avoiding Games","Hard Games"],"content":"\n\nZig Up is an exciting and fast-paced puzzle game that tests your reflexes and encourages quick thinking. Just tap your screen to rotate the zigzagging pieces in order to create and connect endless zigzag lines. Enjoy this variation of the classic game of snake and try to create the longest snake path possible. Challenge your friends, compete for the longest line in the leaderboard and see who will become the ultimate Zig Up champion!","howtoplay":"How to play: Click or tap to change directions","introduce":"Collect the stars and avoid the walls as you move up in the level. Zig and zag back and forth, try to survive for as long as possible while avoiding all of the walls."},{"name":"Slow Down","description":"Play Slow Down game online at Lagged.com. Slow Down is one of our handpicked skill games that can be played on any device.","image":"/data_image/slow-down-game.jpg","source_html":"https://lagged.com/api/play/slow-down/","source_file":"https://lagged.com/en/g/slow-down","category":["Achievement Games","Skill Games","Timing Games","Arcade Games","Reaction Games"],"content":"\n\nSlow Down is a fun and exciting game featuring a variety of obstacles to overcome! Use your reflexes and timing to jump over the hurdles and grab the stars scattered throughout the levels. Collect all the stars to unlock the next level, but be careful to avoid the spikes that lurk around. If you're feeling up for the challenge, you can play in the intense speed mode to really test your skills! Enjoy this thrilling yet simple game, perfect for quick action and relaxing gameplay.","howtoplay":"How to play: Click or tap and hold to slow down the game speed","introduce":"Slow down the game speed to help you avoid all of the obstacles that come into your path. Time your movement just right so you can skirt past any of the deadly blocks as you move up the level. Keep playing to fine tune your skills so that you can top the leaderboards."},{"name":"Nina Back To School","description":"Play Nina Back To School game online at Lagged.com. Nina Back To School is one of our handpicked girl games that can be played on any device.","image":"/data_image/nina-back-to-school-game-79c.jpg","source_html":"https://play.famobi.com/nina-back-to-school/A-0D1OG","source_file":"https://lagged.com/en/g/nina-back-to-school","category":["Girl Games","Dress Up Games","Makeover Games"],"content":"\n\nNina is heading back to school and she needs your help! Join her in this classic dress-up game and help her get ready for her first day. Pick out a perfect outfit for Nina to show off her unique style, mixing and matching different items of clothing to create the best look. Try to get the highest score by completing fun mini-games to collect coins and gems to further customize your character. Show the world your fashion sense with Nina Back to School!","howtoplay":"How to play: Click or tap to makeover Nina","introduce":"Nina must get ready to end her summer and get back to school. Choose her clothing, her make up and her accessories so she can make a great impression on the first day back."},{"name":"Dentist Doctor Teeth","description":"Play Dentist Doctor Teeth game online at Lagged.com. Dentist Doctor Teeth is one of our handpicked girl games that can be played on any device.","image":"/data_image/dentist-doctor-teeth-game.jpg","source_html":"https://lagged.com/api/play2/dentist-doctor-teeth2/","source_file":"https://lagged.com/en/g/dentist-doctor-teeth","category":["Girl Games","Dentist Games","Gross Games","Surgery Games"],"content":"\n\nPut on your scrubs and prepare your best dental tools: it's time to become a tooth-saving dentist in Dentist Doctor Teeth! Treat your patients quickly and accurately to help them fix their cavities and restore a healthy smile. Take X-rays and diagnose teeth problems, fill cavities, use braces, remove cavities, scale and more. Gain points for each treatment, and be the most successful dentist around. And remember to keep your patient happy! Join in the fun of Dentist Doctor Teeth today.","howtoplay":"How to play: Click or tap to clean teeth","introduce":"Sit in the dentist chair and get ready to clean some dirty teeth! Pull out rotten teeth, clean plaque and drill out cavities. Once you clean one mouth a new customer will appear for you to get back to work. "},{"name":"Kick Ups","description":"Play Kick Ups game online at Lagged.com. Kick Ups is one of our handpicked sports games that can be played on any device.","image":"/data_image/kick-ups-game.jpg","source_html":"https://lagged.com/api/play/kick-ups4/","source_file":"https://lagged.com/en/g/kick-ups","category":["Achievement Games","Sports Games","Soccer Games","Ball Games"],"content":"\n\nKick Ups is a classic sports-themed game that never gets old! Test your reflexes and accuracy by trying to keep the soccer ball in the air for as long as possible. You can use different sides of your feet and even your knees to control the ball's movement. Challenge your friends to see who can get the highest score! With simple yet addictive gameplay and stunning visuals, Kick Ups is fun for everyone! Experience the excitement now!","howtoplay":"How to play: Click or tap to kick the ball","introduce":"Try to keep the ball in the air for as long as possible. Keep kicking the ball up in the air, if the ball hits the ground it is game over. Master both modes, normal and challenge modes in order to top the leaderboards and unlock all four achievements."},{"name":"Tap Touch Run","description":"Play Tap Touch Run game online at Lagged.com. Tap Touch Run is one of our handpicked skill games that can be played on any device.","image":"/data_image/tap-touch-run-game.png","source_html":"https://lagged.com/api/play2/tap-touch-run2/","source_file":"https://lagged.com/en/g/tap-touch-run","category":["Achievement Games","Skill Games","Arcade Games","Dash Games","Hard Games","Timing Games"],"content":"\n\nTap Touch Run is an exciting fast-paced running game for all ages! Control your character as they run, dodge and jump through a challenging, randomly generated obstacle course. Tap your screen to jump in order to avoid obstacles, collect coins and power-ups, and aim for high scores! Complete daily challenges and unlock cool power-ups as you progress. With its colorful graphics, energetic soundtrack and simple controls, Tap Touch Run is sure to keep you entertained and running through endless levels of endless fun!","howtoplay":"How to play: Click or tap to rotate and jump. Jump as late as possible to clear gaps.","introduce":"Tip: Jump as late as possible to clear gaps. Help your animal clear each level by safely getting to the finish line. A fast paced running game where you need to stay focused in order to complete each level. Try to help your animals finish all 18 skill based levels."},{"name":"Wheely 3","description":"Play Wheely 3 game online at Lagged.com. Wheely 3 is one of our handpicked puzzle games that can be played on any device.","image":"/data_image/wheely-3-game-wlx.jpg","source_html":"https://html5.gamedistribution.com/6c38a6b5247341ec9086e821f3bffa96/","source_file":"https://lagged.com/en/g/wheely-3","category":["Puzzle Games","Car Games","Brain Games","Thinking Games"],"content":"\n\nWheely 3 is an innovative and fun game where you guide a red Volkswagen beetle around a range of challenging and quirky levels. Help Wheely the Beetle roll, flip and jump his way past obstacles in this platform style puzzle game. Discover a world of interactive objects and unique levels with unique objectives. Sharpen your problem-solving skills as you progress and be sure to collect all the stars and gold stars hidden along the way! With its exciting gameplay and whimsical story, Wheely 3 is a puzzle game you won't be able to put down!","howtoplay":"How to play: Click or tap to control objects","introduce":"The cute red car returns for more puzzle fun! Help your friend escape each of the levels by overcoming many obstacles like lasers and bridges. Use your brain to complete each of the puzzles while going on a fun adventure through the city."}]